{
  "metadata": {
    "totalMembers": 146,
    "lastUpdated": "2025-11-07T16:35:36.196Z",
    "source": "posthog.com/people",
    "dataVersion": "1.0"
  },
  "team": [
    {
      "id": 27732,
      "name": "James Hawkins",
      "firstName": "James",
      "lastName": "Hawkins",
      "role": "Co-CEO",
      "location": "Cambridge, UK",
      "country": "GB",
      "latitude": 52.2055314,
      "longitude": 0.1186637,
      "formattedAddress": "Cambridge, Cambridgeshire, Cambridgeshire and Peterborough, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1738943658/James_H_5cb4c53d9a.png",
      "biography": "I spent the first 10 years of my career trying to be a professional cyclist. I used to do web development part time to make some money on the side. I wasn't particularly good at either.\n\nAfter a growing sense of my own mortality combined with a bunch of large crashes put me off continuing with my cycling career, I bootstrapped an online marketing company to several million dollars a year.\n\nI wanted more experience of working in a VC backed startup, so I could work on something really ambitious. I moved to [Arachnys](https://arachnys.com), and somehow wound up as a their VP of Sales for a little over 4 years, where I used to manage a team selling very large enterprise software deals. We learned how to take our sales from an average of $5K/year to over $1M/year.\n\nI started working with Tim on a few ideas that didn't work out in August 2019. We built PostHog during the [Y Combinator](https://ycombinator.com) W20 batch, and launched in February 2020. You can work out what I've been up to since by stalking me online.\n\nI live in the UK but I travel a lot to the US (5 to 6 times a year) to top up our ambition and to spend time with my cofounder.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2020-01-23",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": [
        {
          "name": "Blitzscale"
        }
      ]
    },
    {
      "id": 27730,
      "name": "Tim Glaser",
      "firstName": "Tim",
      "lastName": "Glaser",
      "role": "co-ceo",
      "location": "London, UK",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1738943701/Tim_297298309a.png",
      "biography": "I've been coding since I've been 11, which isn't as long ago as I'd like it to be. Someone first paid me to write code when I was 13 (though I'm sure they regretted it) and [someone else](https://en.wikipedia.org/wiki/Cloud9_IDE) gainfully employed me when I was 16.\n\nOriginally from the Netherlands, though I quickly moved to London (I do not generally enjoy nice weather) where I joined Arachnys and shortly afterwards met James Hawkins. I went from being a software engineer, to product manager, to \"leading\" an R&D team, which consisted of just me.\n\nAfter four years I thought it was time to go do something else and had lined up a new job. Roughly 37 seconds after it was announced James wanted to \"grab a beer.\" While plying me with alcohol, he convinced me to give up this fancy new job and instead start a startup with him.\n\nIn my 'spare' time, I fall down snowy mountains, wrestle in the mud over an egg-shaped ball and watch a lot of Bondi beach in order to perfect my Australian accent.",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2020-01-24",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28378,
      "name": "PostHog AI",
      "firstName": "PostHog",
      "lastName": "AI",
      "role": "Hedgehog in Residence (and helpful AI chatbot)",
      "location": null,
      "country": "world",
      "latitude": 64.750997,
      "longitude": -147.349319,
      "formattedAddress": "North Pole, Fairbanks North Star Borough, Alaska, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688579513/max_c5dd553db8.png",
      "biography": "At PostHog, we sponsor a hedgehog for every new team member! Our donations support the work of the [Herts and Middlesex Wildlife Trust](https://www.hertswildlifetrust.org.uk/) in the UK, where the hedgehog population has sadly fallen by 50% over the last 20 years.\n\nAs HIR, PostHog AI oversees all hedgehog-related activity, including consuming an omnivorous diet, hibernating during the winter months, and being illegal to own as a pet in Italy and some US states. PostHog AI likes sleeping in dens and dislikes badgers.\n\nPostHog AI also jumps in on community questions and tries to answer as many as possible (with a little help from [Inkeep](https://inkeep.com?utm_source=posthog))!",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": null,
      "startDate": "2020-01-27",
      "teams": [
        {
          "id": 125,
          "name": "Hedgehogs",
          "slug": null
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30202,
      "name": "Marius Andra",
      "firstName": "Marius",
      "lastName": "Andra",
      "role": "Software Engineer",
      "location": "Belgium",
      "country": "BE",
      "latitude": 50.6402809,
      "longitude": 4.6667145,
      "formattedAddress": "België / Belgique / Belgien",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688579570/marius_6a241a6fdc.png",
      "biography": "I first got into programming in 1994 when I wanted to make my own computer games... and asked my father for help. He sat me behind a Turbo Basic interpreter, wrote `PRINT \"Marius on tubli poiss\"` and then left me there. I was 8 years old.\n\nLuckily we had a [Yamaha YIS-805/128R2](https://www.msx.org/wiki/Yamaha_YIS-805-128R2) lying around... with floppy disks full of random .BAS files. I was hooked. Cue to the beautiful loops of CLS, PRINT and GOTO statements that ensued. I even made some games where you could move two dinosaurs who got points when they kissed each other. It was glorious.\n\nI also got into \"web development\" in 1997 after seeing Netscape at my mother's university. They even provided me with a generous 10MB of space to host my own [beautiful website](https://web.archive.org/web/19980128032518/http://rasi.lr.ttu.ee/~marius/), complete with animated gifs, a Mortal Kombat fanpage and a strong recommendation to use 800x600 with HiColor!\n\nThis was followed by years of writing games in C++ and then [writing tutorials](https://web.archive.org/web/20110626030555/http://cone3d.gamedev.net/) about them, coding websites in Perl, PHP, Java and Ruby... and \"losing\" a decade as the CTO of two failed startups.\n\nOn the side I built an [open source database analytics platform](https://github.com/mariusandra/insights)... and when that [got on Hacker News](https://news.ycombinator.com/item?id=22347516), James reached out... and the rest is history.\n\nThese days I live in Belgium and code [state management libraries](https://keajs.org/) in JavaScript for fun.",
      "color": "purple",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2020-05-12",
      "teams": [
        {
          "id": 137,
          "name": "Platform UX",
          "slug": "platform-ux"
        }
      ],
      "leadTeams": [
        {
          "name": "Platform UX"
        }
      ]
    },
    {
      "id": 30209,
      "name": "Eric Duong",
      "firstName": "Eric",
      "lastName": "Duong",
      "role": "Software Engineer",
      "location": "New York, NY",
      "country": "US",
      "latitude": 40.7127281,
      "longitude": -74.0060152,
      "formattedAddress": "City of New York, New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1682365955/eric_c1c2034343.png",
      "biography": "While in college I helped cofound a social dining platform. I spent two years trying to get strangers to cook and dine with each other. In reality, it turned into a 2 year stint of teach yourself as much mobile development as you can while simultaneously trying to build a usable platform. My cofounders and I had our fair share of contemplating dropping out of school and becoming a unicorn in 5 years—it didn't work out.\n\nI currently am the team lead for PostHog's Data warehouse product. I've previously been a part of building out the initial product analytics suite and feature flagging product.\n\nTo end with some obligatory \"I dO MoRE ThAN COdE\" details: I enjoy snowboarding and skiing and I'm currently trying to cycle more. I've also taken a sudden interest in making my own clothes. Ambitions subject to change as always though.",
      "color": "lime-green",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2020-05-17",
      "teams": [
        {
          "id": 116,
          "name": "Data Stack",
          "slug": "data-stack"
        }
      ],
      "leadTeams": [
        {
          "name": "Data Stack"
        }
      ]
    },
    {
      "id": 30174,
      "name": "James Greenhill",
      "firstName": "James",
      "lastName": "Greenhill",
      "role": "Software Engineer",
      "location": "San Francisco",
      "country": "US",
      "latitude": 37.7792588,
      "longitude": -122.4193286,
      "formattedAddress": "San Francisco, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688574967/james_g_d9de6cbcdb.png",
      "biography": "When I was a kid the first thing I remember wanting to be was a pilot, so naturally here I am knee deep in code and data!\n\nGrowing up was slightly different in Florida. Things that are normal there are growing up in the water and spending almost all of your free time in it. In the Gulf of Mexico for me. We’d go swimming, scuba diving, or fishing in that warm body of water almost every weekend.\n\nNowadays I’m spending my free time on a bike finding some new trail up in the northern bits of the Bay Area that I call home now. If not on a bike you’ll find my friends and I on a hike either around here or over in Tahoe or some National Forest east of here. Lately I’m trying to get back into flying. I’ve got about 80 hours of flight in the book, but still don’t have my ticket! It’s time to change that. In the winter time you can find me ruining skis on some mountain.\n\nIn my professional life I’ve generally managed mopping up the 1’s and 0’s. I’ve led data at an [upstart music streaming company](https://en.wikipedia.org/wiki/Grooveshark), and dove way too deep into the depths of the comment section leading data at [Disqus](https://en.wikipedia.org/wiki/Disqus). Kept an eye on a fleet of [Autonomous Ubers](https://en.wikipedia.org/wiki/Uber#Self-driving_car_research). Most recently I combined my interest in bikes with data leading data engineering at [Jump](<https://en.wikipedia.org/wiki/Jump_(transportation_company)>), still the best micromobility company out there.\n\nWhen I’m not out and about in nature you can find me at home with my cat Tesla and Taco our goofball of a Lab Corgi mix.",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2020-06-14",
      "teams": [
        {
          "id": 116,
          "name": "Data Stack",
          "slug": "data-stack"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 27881,
      "name": "Lottie Coxon",
      "firstName": "Lottie",
      "lastName": "Coxon",
      "role": "Illustration Lead ",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688575076/lottie_98ef73aec6.png",
      "biography": "I am from the UK - so by default I love the pub, marmite and tea (but not all at once, that would be a sin).\n\nI spent my youth trying to master fine art, after my teacher said I wasn't very good and that I should try something else.\nIn my stubbornness I decided to prove them wrong, and here I am - a designer.\n\nAfter studying art through school, I took Graphic Design at university and graduated in summer 2020. But instead of a summer of fun, I was faced with a crashing economy, a pandemic and a collapsing job market. But thankfully, after putting my portfolio up on twitter, I was contacted by PostHog a mere 24 hours later, and the rest is history.\n\nI am now their Graphic Designer, and I couldn't be happier. I spend my days designing the product’s brand and most importantly drawing hedgehogs doing silly things.",
      "color": "yellow",
      "pronouns": "she/her",
      "pineappleOnPizza": true,
      "startDate": "2020-06-18",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28847,
      "name": "Michael Matloka",
      "firstName": "Michael",
      "lastName": "Matloka",
      "role": "Software Engineer",
      "location": "Warsaw",
      "country": "PL",
      "latitude": 52.2333742,
      "longitude": 21.0711489,
      "formattedAddress": "Warszawa, województwo mazowieckie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688575052/michael_8f53233c21.png",
      "biography": "When I was seven, I liked to spend my free time assembling LEGO sets. What I enjoyed even more was building new things out of all the bricks I had from _disassembling_ sets. Then one day I deleted `shell32.dll` from the family Windows XP PC.\n\nIt was at that moment I realized computers are much closer to LEGO bricks than magic.\n\nThe fascination with computers progressed from that point. In high school, I became passionate about computer science and software for real. I built up a [portfolio](https://github.com/Twixes/) of open-source projects – some I still maintain, some one-off, and some I've yet to finish. At the end of school, I was not entirely convinced about spending four years at university. It seemed much more worthwhile and fun to learn by _building_ something interesting, so I thought: I might just as well apply to some tech startups and see what happens. This worked out with PostHog, which I've found via Hacker News's monthly \"Who is Hiring?\" thread!\n\nI've acquired some other hobbies too. Juggling them is a challenge:\n\n- astronomy (I was an astrophysics nerd before I realized software is cool too and _much_ easier to make a career out of)\n- travel (goal: visiting all European capitals, currently at 23 out of 46)\n- architecture (buildings and spaces are just as tricky to figure out as software user experiences, except much more permanent)\n- design (my drawing skills are non-existent though)\n- photography (take a look at my [Unsplash profile](https://unsplash.com/@matlokam))\n- cinema and TV (A24 and HBO)\n- music (some genres: electropop, post-classical, soundtracks)\n- LEGO (still, just much more advanced)",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2020-07-13",
      "teams": [
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": [
        {
          "name": "PostHog AI"
        }
      ]
    },
    {
      "id": 28625,
      "name": "Charles Cook",
      "firstName": "Charles",
      "lastName": "Cook",
      "role": "Generic Exec Person",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688579622/charles_525b6ac4e2.png",
      "biography": "I'm the generic exec person who oversees all things commercial at PostHog - that's Sales, CS & Onboarding, Marketing & Content, Billing, Demand Gen, and Support. I was previously COO at [Vitl](https://vitl.com), and before that did basically every role except engineering at [ROLI](https://roli.com).\n\nBorn and raised in the UAE, I'm British-Lebanese, and grew up in fun places like Botswana, Romania, and Serbia. Now based in London, I live with my wife Steph and two sons. \n\nI love terrible jokes, beautifully crafted sandwiches and looking at [designer houses](https://www.themodernhouse.com/) I will never live in. I like to occasionally torment my son with my piano playing and trying to maintain my [50 books/year reading streak](https://app.thestorygraph.com/profile/piemets). ",
      "color": "orange",
      "pronouns": "He/him",
      "pineappleOnPizza": false,
      "startDate": "2020-10-26",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30200,
      "name": "Cory Watilo",
      "firstName": "Cory",
      "lastName": "Watilo",
      "role": "Brand & Design Lead",
      "location": "Tampa, FL",
      "country": "US",
      "latitude": 27.9477595,
      "longitude": -82.458444,
      "formattedAddress": "Tampa, Hillsborough County, Florida, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1703001376/Cory_0625c10074.png",
      "biography": "(It's pronounced WADDLE-low.)\n\n_The most interesting webmaster at [PostHog.com](https://posthog.com)_\n\nAs one of the few PostHoggers who never attempted to enter the world of professional cycling, I instead spend much of my free time exploring new coffee shops or wine bars - generally sipping an iced almond milk latte in the morning and a nice sangria when it hits 5:00 somewhere. On Tuesdays, you can be sure to find me at a Taco Tuesday. (I live for Tuesdays.)\n\nI was once labeled \"The migrating goose of PostHog\" by CEO James Hawkins, as I spent 3+ years traveling the United States [in an RV](https://www.instagram.com/p/CKgpGBYFUdm/). After a few years, I settled down in Tampa, Florida where I swapped the truck and RV for a [golf cart](https://www.instagram.com/p/CfmYzaZOlxL/), which is now my primary mode of transportation!\n\nWhen I'm not wireframing in Balsamiq, designing in Figma, or writing Tailwind CSS, I'm likely building legos with my littles who are certifiably the coolest kids on the planet.\n\nSince I'm a dad, I am legally entitled to make dad jokes. So in light of the rich cycling history of our company, I present the following: \"Why couldn't the bicycle stand up by itself? It was two tired.\"",
      "color": "salmon",
      "pronouns": "",
      "pineappleOnPizza": true,
      "startDate": "2021-01-11",
      "teams": [
        {
          "id": 122,
          "name": "Brand",
          "slug": "brand"
        },
        {
          "id": 137,
          "name": "Platform UX",
          "slug": "platform-ux"
        }
      ],
      "leadTeams": [
        {
          "name": "Brand"
        }
      ]
    },
    {
      "id": 29070,
      "name": "Joe Martin",
      "firstName": "Joe",
      "lastName": "Martin",
      "role": "Marketing Lead",
      "location": "London, UK",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688578142/joe_5c087079c2.png",
      "biography": "In order, I've been: a clown, a morgue cleaner, a chainsaw salesman, a games journalist, and a content consultant. I'm a serial startup guy and joined PostHog as the tenth employee and first marketing hire. \n\nThings I own include: customer stories, the startups programs, email marketing, partnerships, PR, driving user feedback, sales support, copywriting, product launches and announcements, incident comms, worrying overly about things, and telling everyone it is time for lunch. I also hire a lot of really cool people - and not just in the marketing team either. \n\nOutside of work, I’m passionate about long-distance hiking, videogame preservation, and dive bars. When I started at PostHog I couldn’t code at all, but I taught myself enough that I've shipped everything from [DeskHog applications](https://posthog.com/deskhog) to our in-app roadmaps. I'm the worst engineer at PostHog and proud of it.\n\nI'm currently working on [too many things to explain here](https://github.com/PostHog/meta/issues?q=author%3Ajoethreepwood%20Joe%27s%20Goals)",
      "color": "purple",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2021-05-24",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": [
        {
          "name": "Marketing"
        }
      ]
    },
    {
      "id": 28804,
      "name": "Eli Kinsey",
      "firstName": "Eli",
      "lastName": "Kinsey",
      "role": "Front End Engineer",
      "location": "Reno, NV",
      "country": "US",
      "latitude": 39.5261788,
      "longitude": -119.812658,
      "formattedAddress": "Reno, Washoe County, Nevada, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688574893/eli_cbbeee7496.png",
      "biography": "![Screenshot 2025-09-15 at 9.21.29 AM.png](https://res.cloudinary.com/dmukukwp6/image/upload/v1757953377/Screenshot_2025_09_15_at_9_21_29_AM_9bd1af84b3.png)",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2021-08-02",
      "teams": [
        {
          "id": 122,
          "name": "Brand",
          "slug": "brand"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30173,
      "name": "Paul D'Ambra",
      "firstName": "Paul",
      "lastName": "D'Ambra",
      "role": "Software Engineer",
      "location": "North West UK",
      "country": "GB",
      "latitude": 52.8515198,
      "longitude": -1.3325381,
      "formattedAddress": "GL Events UK, Castle Donington, Derby, Leicestershire, England, DE74 2NL, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688575125/paul_64ee2de98e.png",
      "biography": "I've always wanted to solve problems. So, I studied biochemistry. And discovered I am not a biochemist. During and after university, I played in several bands. Without changing the world of music. And fell into a job in I.T. support. For several years I managed I.T. for The British Mountaineering Council. I taught myself to program. Studied an MSc in Computer Science part-time. And discovered that writing software is how I love solving problems.\n\nI'm half Italian. When I was young I refused to learn to speak Italian. Ma sto imparando ora! To make amends I've been learning to make Neapolitan style pizza and [getting pretty good](https://twitter.com/search?q=from%3Apauldambra%20AND%20pizza%20time&src=typed_query&f=live).\n\nThere is a worrying link between the number of programming languages I've used and the number of children I've had. For a while, I was saying I had five children. Until someone pointed out I was counting the dog. My labrador retriever Yoko is - [as measured by photos taken](https://twitter.com/search?q=from%3Apauldambra%20AND%20house%20wolf&src=typed_query&f=live) - my favourite child.\n\nSince becoming a software engineer full-time. I've worked at software agencies. [At a startup](https://twitter.com/footclicksus), building Google Analytics for the physical world (which was like magic _when it worked_). And spent several fulfilling years leading teams at [Co-op Digital](https://twitter.com/coopdigital). I think in diagrams and draw on tables. And I am never happier than in the moments after I have managed to figure out how to make something simpler.\n\nI work pretty hard to remember you can work hard and still have fun.",
      "color": "blue",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2021-09-20",
      "teams": [
        {
          "id": 124,
          "name": "Replay",
          "slug": "replay"
        }
      ],
      "leadTeams": [
        {
          "name": "Replay"
        }
      ]
    },
    {
      "id": 28895,
      "name": "Simon Fisher",
      "firstName": "Simon",
      "lastName": "Fisher",
      "role": "Sales Lead",
      "location": "Sheffield, UK",
      "country": "GB",
      "latitude": 53.3806626,
      "longitude": -1.4702278,
      "formattedAddress": "Sheffield, South Yorkshire, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688575173/simon_bb4af1b047.png",
      "biography": "I currently lead the Sales and Customer Success Team at PostHog, and am personally responsible for large customer relationships too.  I'm a firm believer in doing sales in a non-salesy way and meet customers where they are at in their buying process.\n\nAfter studying four years of Computer Science at the University of Sheffield in the UK I realised that I enjoyed presenting to humans and helping them solve their own problems with technology rather than hacking away at my (middling) code all day; thus a career in Customer Success was born. My main focus in this journey has been helping people automate lots of different things:\n- IBM (7 years) - automate build and deployment\n- CA Technologies (1.5 years) - automate build and deployment but with a different product\n- Chef Software (5 years) - automate infrastructure and compliance\n- Logz.io (1 year) - automate monitoring and observability\n\nAs you can tell, my passion is helping people automate all of the things so along the way I've picked up skills in DevOps, Cloud, and many adjacent areas. I also led technical teams at Chef and Logz.io so I'm passionate about developing high-performing groups of customer-obsessed people.\nNotwithstanding my above comment about avoiding coding 9-5, I do like to keep my hands dirty with technology and I've been maintaining a website for people with Type 1 Diabetes (like myself) since 2008 which has helped me level up in Ruby, Javascript, Containers and lots more.\n\nI live in Sheffield in the North of the UK with my wife, 3 young boys and a black labrador so have a very busy home life, mainly focused on taking the boys to various sporting clubs, long walks in the woods and Lego building.\n\nWhen not working or family-ing I enjoy gaming on the Xbox (I've recently enjoyed Cyberpunk 2077, Alan Wake 2 and Jedi Survivor), watching superhero films and home automation. My all-time favourite TV show is The Office: An American Workplace and 90% of the GIFs I use come from there.",
      "color": "seagreen",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2022-01-03",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        },
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30208,
      "name": "Andy Vandervell",
      "firstName": "Andy",
      "lastName": "Vandervell",
      "role": "Content Marketer",
      "location": "London, UK",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1695024176/andy_86a7232754.png",
      "biography": "Previously a journalist. I worked in online publishing when magazines were still a big deal. I started out as a consumer tech editor in the mid-2000s. Later in my career I moved into audience development, including stints at Time Inc. (TrustedReviews), Condé Nast (WIRED), and LBG Media.\n\nAt PostHog I edit all the words, keep an eye on marketing metrics, and feed the Google bots. I also run our newsletter, [Product for Engineers](https://newsletter.posthog.com/).\n\n**Things I like:**\nDogs, cricket, Formula 1 (motorsport in general), good sci-fi, online sim racing (and taking it way too seriously), really good words. En dashes.\n\n**Things I dislike:**\nMarvel and DC movies, Em dashes (see my README)",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2022-01-03",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": [
        {
          "name": "Content"
        }
      ]
    },
    {
      "id": 28626,
      "name": "Coua Phang",
      "firstName": "Coua",
      "lastName": "Phang",
      "role": "Tech Talent Partner",
      "location": "United States",
      "country": "US",
      "latitude": 39.7837304,
      "longitude": -100.445882,
      "formattedAddress": "United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1723108430/coua_cfd12727dc.png",
      "biography": "Professionally, I have been in people ops for 16 years, and in tech for the last 11 years. I have worked in small to mid-sized companies building and scaling teams across several functions. \n\nPersonally, I am a self-proclaimed foodie with a passion for exploring new restaurants (and the occasional food coma). When I am not indulging in food adventures, you can find me at home, knee-deep in house projects and proudly claiming the title of \"amateur gardener\" (green thumb in progress).\n\nBorn into a big, lively family of nine siblings and eighteen nieces and nephews, I’ve mastered the art of juggling chaos and turning it into something spectacular—kind of like my \"messy organized\" lifestyle which probably makes me the most flexible team member out of the Ops team 😂\n\nBut wait, there’s more! When I am not hanging out with family and friends, you can find me always daydreaming about my next trip. I love traveling and try to make at least one out-of-the-country trip every year while the rest of my free time is spent taking short domestic weekend trips to continue my conquest of finding some of the best foods– particularly soup dumplings and ramen. Lastly, if I am not doing any of the above, I am watching documentaries and listening to some interesting podcasts to get myself in a meditative state. \n",
      "color": "green",
      "pronouns": "She/Her",
      "pineappleOnPizza": false,
      "startDate": "2022-04-20",
      "teams": [
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": [
        {
          "name": "Talent"
        }
      ]
    },
    {
      "id": 30205,
      "name": "Ben White",
      "firstName": "Ben",
      "lastName": "White",
      "role": "Exec Person for the Backend Homies",
      "location": "Munich",
      "country": "DE",
      "latitude": 48.1371079,
      "longitude": 11.5753822,
      "formattedAddress": "München, Bayern, Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1685551872/ben_adeee56656.png",
      "biography": "Servus! 👋 By day I'm a Software Engineer jumping into every part of the stack I can get my hands on - by night I'm a <strike>legendary</strike> amateur musician <strike>touring the world</strike> writing silly songs in my lovely little corner of Munich, Germany.\n\nI've had a fairly varied career from big places to startups to consulting to indie-app-development but always with Product at the heart of it - I love being part of making something that people get genuine delight from. More importantly I love bringing delight to the people around me whether that's with my home baking, terrible jokes or spontaneous songs (like the one I played to all my new colleagues in the first weeks at PostHog 🙉). I don't believe in being embarrassed - the best things happen when you open yourself up and share what your passionate about.\n\nI try to work on as much of PostHog as I can, going wherever the most challenging problem lies. Secretly though my favourite thing to work on is Hedgehog Mode 🦔",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2022-05-05",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": [
        {
          "name": "Replay"
        },
        {
          "name": "Workflows"
        },
        {
          "name": "Batch Exports"
        }
      ]
    },
    {
      "id": 28619,
      "name": "Annika Schmid",
      "firstName": "Annika",
      "lastName": "Schmid",
      "role": "Product Manager",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688574811/annika_c7906c4925.png",
      "biography": "Believe it or not, my first job included writing exciting marketing campaigns for [robotic handling systems](https://www.schmalz.com/). (It wasn’t that exciting.) So I ended up moving to London in 2019 to study for an MSc in Human-Computer Interaction at UCL. (Way more exciting.) My plan was to land a job in a startup after graduating, which, through a bit of ‘hustling’ ([Sigma Squared Summit,](https://www.sigma-squared.org/summit/) [Voyagers,](https://voyagers.io/) [Kickstart London](https://www.kickstartglobal.com/)) and being in the right place at the right time actually worked out.\n\nAfter graduating, I joined an early-stage startup called [Caura](https://caura.com/), where I first had the title of a Product Designer and later on, that of a Product Manager. Titles aside, what motivates me most in my work is talking to users about what they want, uncovering what they actually mean by that and then building something they didn’t even think they needed.\n\nI joined PostHog in autumn 2022, arguably the most exciting step in my career so far.\n\nWhat else? On weekends, I hang out with friends, try to make a dent in my ever growing reading list or learn something new. My family is from the Black Forest region in Germany, so I spend a couple of weeks every year working from there, going on lots of countryside walks and eating Black Forest gateau.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2022-09-05",
      "teams": [
        {
          "id": 133,
          "name": "Experiments",
          "slug": "experiments"
        },
        {
          "id": 115,
          "name": "Feature Flags",
          "slug": "feature-flags"
        },
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 29296,
      "name": "Ian Vanagas",
      "firstName": "Ian",
      "lastName": "Vanagas",
      "role": "Technical Content Marketer",
      "location": "Vancouver",
      "country": "CA",
      "latitude": 49.2608724,
      "longitude": -123.113952,
      "formattedAddress": "Vancouver, Metro Vancouver Regional District, British Columbia, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1741770588/ian_31bf16ef7d_c3339bc255.png",
      "biography": "Hi, I’m Ian. I’m a writer and software developer based in Vancouver. Unlike many at PostHog, I’ve lived nearly my entire life on the west coast of Canada.\n\nMy career started in sales and customer success as I thought it could lead to working on products as a “non-technical” person. I realized, if I learned to code, I could control my destiny and build products myself. So I did it, and that led to work at a few small startups and my own side projects.\n\nAt the same time, I wrote about areas that interested me like products, communities, and internet culture. Among other achievements, my writing made it to the top of HackerNews (twice). I’ve also written for startups working in crypto, devtools, and community. \n\nOutside of work, writing, and coding, I lift weights (working on my squat PR), run, learn Spanish, and read a range of non-fiction books.",
      "color": "purple",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2022-09-19",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28628,
      "name": "Kendal Ijeh",
      "firstName": "Kendal",
      "lastName": "Ijeh",
      "role": "People Operations Manager",
      "location": "Norfolk, UK",
      "country": "GB",
      "latitude": 52.666667,
      "longitude": 1,
      "formattedAddress": "Norfolk, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1741680368/kendal_7a48455bbb_a9341ee95f.png",
      "biography": "At PostHog, I serve as People Operations Manager, a role that combines the diplomatic skills of a UN ambassador, the logistics chops of a military general, and the snack‑ordering abilities of a mum on a road trip. My job is to keep our one‑of‑a‑kind culture alive, wrangle Hogs into planes and meeting rooms, orchestrate unforgettable offsites and meetups, and make onboarding so smooth it should win a Michelin star.\nI’ve been called many things: Spreadsheet Sorceress, Teammate Wrangler‑in‑Chief, and (by one anonymous teammate) “that person who somehow got us all to karaoke at 2am.” Honestly, all accurate.\n\nIn my personal life, I reside in the Norfolk countryside with my husband and our cat‑shaped over-lady, Meatloaf. Meatloaf is fluffy, wears bow ties, and is the undisputed CEO of our household. I mostly exist to refill her food bowl.\nWhen I’m not helping keep PostHog’s culture weird (but functional), you’ll find me binding books (old‑timey hobby? Yes. Cool? Also yes.), crocheting at competitive speeds, yelling at F1 cars to “brake later” (they never listen), reading in my hammock while being menaced by local wildlife, or disappearing into the countryside like a Victorian ghost who also knows how to use Google Maps.\n\nCertified in:\n- Herding software engineers without a net\n- Remembering everyone’s dietary restrictions\n- Detecting when morale needs cake\n- Packing suitcases that defy physics\nAwards include:\n- “Most Likely to Have Snacks in Her Bag”\n- “Best Impromptu Pub Finder, 2024”\n- “Employee Least Likely to Panic (Outwardly)”\n- “Nicest Bookbinding WIP Nobody’s Allowed to Touch”\n\nIf you’re ever at a PostHog event and wondering who made it feel like summer camp but with better food and fewer mosquitoes, that was probably me. If you’re ever lost at an airport, panicking before your first day, or just in desperate need of a biscuit and a pep talk, don’t worry. I’ve got you.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2022-09-28",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28627,
      "name": "Daniel Esneider Jaramillo",
      "firstName": "Daniel",
      "lastName": "Esneider Jaramillo",
      "role": "SRE Engineer",
      "location": null,
      "country": "CO",
      "latitude": 44.5256019,
      "longitude": -73.67764,
      "formattedAddress": "North Pole, Town of Black Brook, Clinton County, New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688574860/daniel_ab1f1899a9.png",
      "biography": "Hi there! My name is Daniel Esneider, and I am an SRE engineer with a strong desire to learn and improve. I am always looking for ways to contribute to my company and make a positive impact. In my free time, I enjoy spending time with my family, playing soccer, and pursuing my passion for agriculture, specifically coffee beans. I have a solid foundation in both technical and practical skills, and I am always looking for ways to learn and grow in my field. When I’m not working on complex projects or tending to my farm, I love spending time with loved ones and approaching every task with enthusiasm and a commitment to excellence.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2022-10-11",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28693,
      "name": "Raquel Smith",
      "firstName": "Raquel",
      "lastName": "Smith",
      "role": "Engineering exec person",
      "location": "San Luis Obispo, CA",
      "country": "US",
      "latitude": 35.3540209,
      "longitude": -120.375716,
      "formattedAddress": "San Luis Obispo County, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688575146/raquel_96e46e6847.png",
      "biography": "I'm a scientist at heart who loves taking complex ideas and combining them into one simple product that users love - and that's why I'm a home cook.\n\nJuuuust kidding. That's why I write code! I wrote my first line of \"code\" when I was 19 years old trying to change the color of an h1 on my WordPress website. I found the stylesheet, changed the hex code, sweated bullets as I pressed the save button, and then my jaw hit the floor when it worked. I continued to tinker with websites through my dual undergrad programs in Molecular Biology and Microbiology, and finally after graduating taught myself how to actually code.\n\nIn my career I've built websites for food bloggers, headed up Product at a manufacturing tech startup, built and ran my own startup (it failed), and finally found my happy spot here at PostHog, where I ran the growth team for a couple years and later moved to the exec team to help make sure teams have the right context to make the best decisions for their users.\n\nI live in San Luis Obispo, CA with my husband, AJ, our two little girls, Kacey and Norah, and our black lab pup, Dedas. We also recently got a silly cat named Truffles. In my spare time you'll either find me riding my mountain bike on the local trails or making tasty food in my kitchen (I do actually really like to cook).",
      "color": "teal",
      "pronouns": "she/her",
      "pineappleOnPizza": true,
      "startDate": "2022-11-02",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30210,
      "name": "Thomas Obermüller",
      "firstName": "Thomas",
      "lastName": "Obermüller",
      "role": "Software Engineer",
      "location": "Munich",
      "country": "DE",
      "latitude": 48.1371079,
      "longitude": 11.5753822,
      "formattedAddress": "München, Bayern, Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1688578166/thomas_eff3f227fc.png",
      "biography": "Hi, my name is Thomas, I'm 35 years old and live in the beautiful city of Munich together with my girlfriend. I’ve been interested in programming and entrepreneurship since I was a small kid, originally wanting to become a game developer.\n\nAfter school, I studied mathematics and physics with the desire to better understand how the world works - do we have a free will or is everything deterministic? [Richard Feynman](https://en.wikipedia.org/wiki/Surely_You're_Joking,_Mr._Feynman!) surely left an impression on me. However it soon became clear that the answers I'd get wouldn’t fulfil my desire. \n\nI also always knew I didn’t want to pursue a traditional career (e.g. insurance) and towards the end of my bachelor I was looking to join a startup part-time. At a local event I quickly found out that technical people are in high demand. I met the founders of [Freeletics](https://www.freeletics.com), was immediately convinced, and joined them as CTO &ndash; full-time.\n\nAfter a meteoric rise to 120 people and multi-million users, it was time for a new adventure and I co-founded [Workpath](https://www.workpath.com) with two people from the local startup scene.\n\nEnterprise is fun for a while, but at some point I wanted to get back to building more consumer facing products. That’s when I decided to combine passion with job and founded [Passion Climb](https://www.passion-climb.com), which I now maintain as a side project. \n\nLooking for more peace of mind and not being the ultimate decision maker for a bit, I joined the fantastic team at PostHog, which I have already used myself at Passion Climb. And thus, here I am, focusing on building a great UI and making a product people love.\n\nIn my free time, I love climbing, being outdoors, vanlifing, cooking and great food in general.",
      "color": "red",
      "pronouns": null,
      "pineappleOnPizza": null,
      "startDate": "2022-11-14",
      "teams": [
        {
          "id": 118,
          "name": "Product Analytics",
          "slug": "product-analytics"
        }
      ],
      "leadTeams": [
        {
          "name": "Product Analytics"
        }
      ]
    },
    {
      "id": 29192,
      "name": "Frank Hamand",
      "firstName": "Frank",
      "lastName": "Hamand",
      "role": "Senior YAML Engineer (Infrastructure)",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1739635748/Frank_7ba1d93d62.png",
      "biography": "When I'm not making the world a better place through Paxos algorithms for consensus protocols I'm working on new and innovative ways to write complex data infrastructure platforms in YAML",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-03-06",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 29456,
      "name": "Tomás Farías",
      "firstName": "Tomás",
      "lastName": "Farías",
      "role": "Software Engineer",
      "location": "Germany",
      "country": "DE",
      "latitude": 51.1638175,
      "longitude": 10.4478313,
      "formattedAddress": "Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196601/Tomas_b3826ac52f.png",
      "biography": "I am terrible at talking about myself, so here is what I thought about putting here and why I didn't:\n\n* A short summary of basic facts about myself (age, place of birth, etc...).\n    * Rejected because: Opens up the door to biases (but doesn't everything, even this very question?).\n* My life story.\n    * Rejected because: Both past achievements and failures are only as valuable as their signal power to predict the future. More often than not, they can't.\n* A joke.\n    * Rejected because: I don't know any, and it's not worth it to spend resources asking AI for one.\n* My job description.\n    * Rejected because: I write code in a start-up; my job description means very little beyond that, and I enjoy that.\n* My personal interests.\n    * Rejected because: My head is in work mode and can't think about my interests. The short summary is computer stuff, games (board and video), and lifting weights.\n* Some permutation of all or some of the above.\n    * Rejected because: n! possible options depending on sample size.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": null,
      "startDate": "2023-06-26",
      "teams": [
        {
          "id": 135,
          "name": "Batch Exports",
          "slug": "batch-exports"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30203,
      "name": "David Newell",
      "firstName": "David",
      "lastName": "Newell",
      "role": "Product Engineer",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1694452808/david_newell_3010203bfd.png",
      "biography": "An aspiring biography writer who lacks inspiration...\n\nHaving grown up in Ireland, I started learning to code towards the end of high school. I studied Computer & Electronic Engineering where I took courses in telecommunications, embedded systems and SOC. Realising a greater passion for software I was offered an internship at [Intercom](https://intercom.com) and never looked back at hardware again.\n\n![image.png](https://res.cloudinary.com/dmukukwp6/image/upload/v1758888051/image_551a077e48.png)\n\nBefore PostHog, I was the founder of a Y Combinator company. We built 6 different products in 3.5 years before I eventually decided it was time for a change.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-06-26",
      "teams": [
        {
          "id": 130,
          "name": "Error Tracking",
          "slug": "error-tracking"
        }
      ],
      "leadTeams": [
        {
          "name": "Error Tracking"
        }
      ]
    },
    {
      "id": 29292,
      "name": "Robbie Coomber",
      "firstName": "Robbie",
      "lastName": "Coomber",
      "role": "Full Stack Engineer",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1698054622/Robbie_7cd9705e39.png",
      "biography": "I visited the London Science Museum too many times as a kid and now I love building and playing with technology. Now I'm building things that are indistinguishable from magic.\n\nMy mum was a programmer in the 80s, and I grew up around computers. I studied Computer Science at the University of Cambridge, and worked in startups across a variety of industries.\n\nBefore I joined PostHog I was co-founder / CTO of Blueheart, and I have extremely strong opinions about what is missing from the various product analytics tool available, and have been fixing that with PostHog.",
      "color": "teal",
      "pronouns": "He\\him",
      "pineappleOnPizza": null,
      "startDate": "2023-08-07",
      "teams": [
        {
          "id": 152,
          "name": "Analytics Platform",
          "slug": "analytics-platform"
        }
      ],
      "leadTeams": [
        {
          "name": "Analytics Platform"
        }
      ]
    },
    {
      "id": 30211,
      "name": "Marcus Hof",
      "firstName": "Marcus",
      "lastName": "Hof",
      "role": "Product Engineer",
      "location": "Germany",
      "country": "DE",
      "latitude": 51.1638175,
      "longitude": 10.4478313,
      "formattedAddress": "Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1698054319/marcus_cb55867b99.png",
      "biography": "I’m Marcus, a product engineer in [the messaging team](https://posthog.com/teams/cdp.). Currently working on realtime destinations and the messaging v1.\n\nBefore PostHog I was building an open-source loom alternative at [Snapify](https://snapify.it/) and reached [the front page of HackerNews using Tablane](https://news.ycombinator.com/item?id=34279062). ",
      "color": "red",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-08-07",
      "teams": [
        {
          "id": 143,
          "name": "Workflows",
          "slug": "workflows"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30206,
      "name": "Manoel Aranda Neto",
      "firstName": "Manoel",
      "lastName": "Aranda Neto",
      "role": "Mobile Engineer",
      "location": "Austria",
      "country": "AT",
      "latitude": 47.59397,
      "longitude": 14.12456,
      "formattedAddress": "Österreich",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1698054453/Manoel_e45b12938f.png",
      "biography": "Brazilian by birth, Italian in spirit, currently lost somewhere in Austria.\n\nMobile Engineer by trade. Android enthusiast… tragically trapped in an iPhone.\n\nGym rat with a food obsession, basically in a toxic relationship with my bathroom scale.\n\nMy life is full of contradictions, but one thing's for sure: pineapple on pizza is a crime.",
      "color": "salmon",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2023-09-05",
      "teams": [
        {
          "id": 157,
          "name": "Mobile",
          "slug": "mobile"
        }
      ],
      "leadTeams": [
        {
          "name": "Replay"
        },
        {
          "name": "Mobile"
        }
      ]
    },
    {
      "id": 29577,
      "name": "Tom Owers",
      "firstName": "Tom",
      "lastName": "Owers",
      "role": "Full Stack Engineer",
      "location": "United Kingdom",
      "country": "GB",
      "latitude": 54.7023545,
      "longitude": -3.2765753,
      "formattedAddress": "United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1700147511/Tom_7525e646ff.png",
      "biography": "I started coding as a kid, stemming from taking apart computers and occasionally being successful when putting them back together. Moved to London to attend university and consequently entered the world of start-ups - mostly marketplaces, from small to large. \n\nOutside of tech, you can usually find me snowboarding the French alps in the winter, and cycling the Spanish mountains in the summer. ",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-09-11",
      "teams": [
        {
          "id": 116,
          "name": "Data Stack",
          "slug": "data-stack"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 29792,
      "name": "Juraj Majerik",
      "firstName": "Juraj",
      "lastName": "Majerik",
      "role": "Full Stack Engineer",
      "location": "Amsterdam",
      "country": "NL",
      "latitude": 52.3730796,
      "longitude": 4.8924534,
      "formattedAddress": "Amsterdam, Noord-Holland, Nederland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1698054555/Juraj_d9e5706d26.png",
      "biography": "I had been building  [radio-controlled planes](https://i.imgur.com/wOGMVlN.jpeg)  for much of my teens. This taught me precision, coming up with my own designs and having them stand the test of physics.\n\nAfter three years of studying economics, I toyed with a  business idea that led nowhere - except for leading me to learn web development. After a brief stint as a translator at Booking.com, I pivoted to programming in earnest and haven't looked back since.\n\nI spent the last couple of years as a full stack engineer at a startup focusing on news analytics. I learned a ton and got to wear many hats. Among other things, I built the Alerts product and the  scoring & aggregation part of the pipeline, which processes up to a million articles per day.\n\nOn the side, I'm working on a  [ride-sharing simulation](https://rides.jurajmajerik.com/)  and writing a  [blog](https://jurajmajerik.com/). My project was  [featured](https://newsletter.pragmaticengineer.com/p/an-educational-side-project)  on The Pragmatic Engineer, the #1 technology newsletter on Substack.\n\nI love cycling, hiking, flight simulators, and reading novels, biographies and history. I'm a blue belt in Brazilian Jiu-Jitsu and I enjoy riding motorbikes - here's me and my friends [traveling](https://www.youtube.com/watch?v=9-GGLvXJakc)  across Vietnam.",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-09-19",
      "teams": [
        {
          "id": 133,
          "name": "Experiments",
          "slug": "experiments"
        }
      ],
      "leadTeams": [
        {
          "name": "Experiments"
        }
      ]
    },
    {
      "id": 29561,
      "name": "Julian Bez",
      "firstName": "Julian",
      "lastName": "Bez",
      "role": "Full Stack Engineer",
      "location": "Germany",
      "country": "DE",
      "latitude": 51.1638175,
      "longitude": 10.4478313,
      "formattedAddress": "Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1700222597/Julian_0e5430df9d.png",
      "biography": "I’m a software engineer with over a decade of experience building and leading projects across the stack. My background spans backend and frontend development, with hands-on expertise in Python, Django, TypeScript, React, Elasticsearch, and Celery.\n\nOver the years, I’ve designed and implemented scalable architectures, improved engineering workflows, and guided teams through complex projects. I enjoy creating an environment where people can do their best work, and I believe that collaboration and clear communication are just as important as technical skill.\n\nI’m pragmatic when it comes to decision-making, always aiming for solutions that strike the right balance between innovation and practicality. Staying current with new tools and practices is important to me, and I’m constantly looking for ways to refine the development process and raise the quality bar.\n\nWhether it’s launching a new product or contributing to an existing system, I bring a mix of technical depth, adaptability, and creativity. At the end of the day, my focus is on building software that’s not only reliable and efficient, but also genuinely useful for the people who use it.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2023-11-06",
      "teams": [
        {
          "id": 153,
          "name": "Developer Experience",
          "slug": "developer-experience"
        }
      ],
      "leadTeams": [
        {
          "name": "Developer Experience"
        }
      ]
    },
    {
      "id": 30207,
      "name": "Fraser Hopper",
      "firstName": "Fraser",
      "lastName": "Hopper",
      "role": "Ops & Finance Lead",
      "location": "Glasgow",
      "country": "GB",
      "latitude": 55.861155,
      "longitude": -4.2501687,
      "formattedAddress": "Glasgow, Glasgow City, Alba / Scotland, G2 1AR, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1702389953/Fraser_d164c2e11b.png",
      "biography": "I am originally from Glasgow, Scotland, where I live today via Sweden, New Zealand, Australia, San Francisco and more recently London for nearly 10 years. \n\nI decided at 16 that I was going to study Law, because my friends were doing that. When I started university at 17 I realised it was a lot of reading, and when I started working in law firms at 18 I knew it wasn't for me. However, it took me until 21 to fully turn my back on my short-lived career in the law. It was then I headed to the Southern Hemisphere where I spent 18 months working as a barista and my love of coffee began, which still burns brightly. \n\nIn 2013 I moved from Melbourne to London and joined my first startup, a YC company called Homejoy. It could not have been further from my time in law firms and I loved it. My career in Operations since then has transitioned from working in marketplaces to B2B SaaS, the latter where I have worked for the last 8 years in Ops & Finance. \n\nAt PostHog I am the Ops & Finance lead and I like things to run smoothly. I am mainly focused on making sure we don't run out of money, we don't get sued and making sure our team are very happy. All very important things that I take very seriously, I don't take myself seriously at all.\n\nI love puns, I love films & tv, I love sports. I can usually be found outside work playing golf or watching football, predominantly following my team the length and breadth of Scotland, and sometimes across Europe. \n\nAt a previous startup, I met a girl called Sinead who I quite liked and I managed to convince her to move with me to Glasgow and we now have a son called Patrick (Sinead and Patrick are Irish, if it wasn't obvious). We spend a lot of time in Dublin with their family, which is great fun. \n\nMy biggest fear is people would hesitate to reach out to me with a question. Please, please, please reach out! ",
      "color": "green",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2023-11-19",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        },
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": [
        {
          "name": "People & Ops"
        }
      ]
    },
    {
      "id": 29862,
      "name": "Mine Kansu",
      "firstName": "Mine",
      "lastName": "Kansu",
      "role": "Revenue Operations",
      "location": "New York",
      "country": "US",
      "latitude": 40.7127281,
      "longitude": -74.0060152,
      "formattedAddress": "City of New York, New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1704468198/Mine_dc7d915835.png",
      "biography": "I started my career in finance and eventually found my way into tech, where I love working with smart people on difficult problems while wearing casual clothes. Outside of work, I enjoy visiting museums, eating good food, and reading books.",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2023-12-17",
      "teams": [
        {
          "id": 141,
          "name": "Billing",
          "slug": "billing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 28949,
      "name": "Steven Shults",
      "firstName": "Steven",
      "lastName": "Shults",
      "role": "Technical Support Engineer",
      "location": "Seattle",
      "country": "US",
      "latitude": 47.6038321,
      "longitude": -122.330062,
      "formattedAddress": "Seattle, King County, Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1711641190/Steven_fdb952b5e0.png",
      "biography": "When I was a kid, my grandfather showed me something that blew my little mind: his new Atari Pong console. I'm pretty sure that was the day that my interest in computing began. Later, in high school, I didn't hesitate to sign up for a \"Programming In Basic\" class which was offered after The Tandy Corporation donated 30 new TRS-80s.  (insert Blade Runner \"like tears in the rain\" meme here.)\n\n I was distracted by storytelling for quite a while though. I was a theatre artist from age 12 on into my mid-30s. From my teens into my mid-20s I waited tables to support my theatre habit. Then, after the Mosaic browser introduced the world to the WWW, I switched to tech support to pay the bills.\n\nI quickly realized that working with talented, passionate people on building Internet-related products and services to delight users could be as fun as working on a theatrical production to delight audiences. So I kept a foot in both worlds (theatre and tech) for 10 years, building out tech support infrastructure for startups by day, rehearsing and performing during nights and weekends.\n\nThen I became a parent. A choice had to be made. So, to provide better opportunities for my kids, I shelved my theatre habit and stayed focused on tech and parenting.  \n\nAfter working with a few startups early in my career, I settled at a real estate technology startup for almost 18 years. They were acquired by a larger company during my 14th year.  I survived the first round of layoffs, but not the second. I didn't realize it at the time, but I was very fortunate to have been laid off when I was, because...\n\nThen I had the good fortune of being invited to join PostHog in March of 2024.  I'm writing this after only three days on the job, but I really don't recall having been this excited by a new job in a very long time (or ever, if I omit a few choice acting roles from that list. 😊)\n\nIn my free time, I can usually be found practicing guitar (late blooming hobbyist, started learning in 2017), listening to music, reading, working on [my website](https://shakespeare-monologues.org/), spending time with one or both of my adult kids, and/or our 3 cats. \n\nEpilogue:\nThere is a place for pineapple on pizza.*\n\n\\* but only if the only other topping is pepperoni. 🤓 ",
      "color": "teal",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2024-03-20",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30369,
      "name": "Sandy Spicer",
      "firstName": "Sandy",
      "lastName": "Spicer",
      "role": "Product Engineer",
      "location": "Oakland",
      "country": "US",
      "latitude": 37.8044557,
      "longitude": -122.271356,
      "formattedAddress": "Oakland, Alameda County, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1717509543/Sandy_1_678a9db1dd.png",
      "biography": "I don't love writing about myself and this is very freeform, and I'm drawing a blank on what to say, so I'm going to make up some questions and answer those instead.\n\n# What is your favorite food\nProbably Roti Prata with a good mutton curry  \n\n# What is your favorite activity\nDownhill skiing, but it has been hard to find time for this as I had a baby recently. Hope to get back to it when the kids can do it too!\n\n# When did you learn to code?\nProbably at a summer camp, don't remember the year. I got a bad rap with the counselors because I kept finding bugs in their instructions and tests.\n\n# When is your favorite holiday?\nA wash between the 4th of July and Thanksgiving probably.",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-04-25",
      "teams": [
        {
          "id": 152,
          "name": "Analytics Platform",
          "slug": "analytics-platform"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30455,
      "name": "Dylan Martin",
      "firstName": "Dylan",
      "lastName": "Martin",
      "role": "Product Engineer",
      "location": "Seattle",
      "country": "US",
      "latitude": 47.6038321,
      "longitude": -122.330062,
      "formattedAddress": "Seattle, King County, Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1717422439/Dylan_1_9030227ace.png",
      "biography": "I'm a seasoned software engineer, excitable but inconsistent writer, career mentor, math enthusiast, ski bum, rock climber, amateur powerlifter, overzealous intramural athlete, plant dad, jazz pianist, language geek, and deep learning dilettante.\n\nI've always been fascinated by the intersection of creativity and constraints.  I love understanding how systems work and exploring the grey areas between well-defined spaces.\n\nIn college I studied physics and music – the physics helped me understand how the world worked, and then music helped color it in.  I don't do a lot of physics anymore, but I still play music regularly (mostly in my living room, but I'll play venues around town from time to time).\n\nProfessionally, I'm a startup veteran who loves building the foundational systems upon which successful companies are built.  I love programming languages, static types, opinionated DevEx, making APIs go fast, [sanding user interfaces](https://blog.jim-nielsen.com/2024/sanding-ui/), and crafting simple user experiences that bely complex operations under the hood. I've worked at 3 unicorn startups so far across a variety of industries – robotics, fintech, and [Utah's biggest SaaS exit](https://news.ycombinator.com/item?id=18431625) – and I'm eager to make PostHog the biggest and best one yet!\n\nI live on the shores of Lake Union with my wife, various instruments, some tasteful furniture, and lots of plants.  We love traveling, coffee, playing outside, trail running, watching bad TV, talking about software, and experimenting in the kitchen.\n\nSome of fun facts about me:\n- I've skied in 4 different continents (and have a life goal to ski in all 7)\n- I went semi-viral on LinkedIn for playing piano at an Elton John concert\n- Years ago, [I accidentally won a fashion contest in Dublin](https://www.independent.ie/style/fashion/fashion-news/shes-done-it-again-designer-laura-jayne-halton-wins-another-best-dressed-lady-prize-at-leopardstown/34430892.html)",
      "color": "green",
      "pronouns": "He/Him",
      "pineappleOnPizza": true,
      "startDate": "2024-05-12",
      "teams": [
        {
          "id": 115,
          "name": "Feature Flags",
          "slug": "feature-flags"
        }
      ],
      "leadTeams": [
        {
          "name": "Feature Flags"
        }
      ]
    },
    {
      "id": 30684,
      "name": "Seb Maier",
      "firstName": "Seb",
      "lastName": "Maier",
      "role": "Solutions Engineer-ish",
      "location": "Netherlands",
      "country": "NL",
      "latitude": 52.2434979,
      "longitude": 5.6343227,
      "formattedAddress": "Nederland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1719843271/Seb_9d9fc3a92c.png",
      "biography": "Hey! \n\nMy journey into computers started with my Dad's Amstrad PCW a.k.a Schneider Joyce, messing with legendary Windows 3.1 machines and the like. Nowadays I am big into home automation, IoT and over-engineering what could be a simple project thanks to the power AI gives me, with a hint of self-taught Python and YAML skills. \n\nYet, my favourite devices ever remain a Nokia 9110 communicator and an iPaq1940. \n\nIn my free time away from screens I love traveling (especially to Asia and anywhere with good dive spots), watch and do sports and anything to do with aviation. A lot of that free time is spent on training for my Private Pilot License. ",
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-06-03",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30798,
      "name": "Georgiy Tarasov",
      "firstName": "Georgiy",
      "lastName": "Tarasov",
      "role": "Product Engineer",
      "location": "Barcelona",
      "country": "ES",
      "latitude": 41.3825802,
      "longitude": 2.177073,
      "formattedAddress": "Barcelona, Barcelonès, Barcelona, Catalunya, España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1719926969/georgiy_1_e3ebc60980.png",
      "biography": "Hi, I'm Georgiy. My journey into programming began with writing Lua scripts for a popular online game just for fun. I quickly realized that there was a niche selling extensions and plugins to others, so it became a small enterprise and a fun hobby for the next few years. Later in life, I started a few businesses and joined a failed startup. One day, while searching for product management resources tailored for engineers, I came across the [Product for Engineers](https://newsletter.posthog.com/) newsletter from PostHog. I've always liked the idea of software engineers being close to customers, so I applied the gathered knowledge in my daily job, which worked exceptionally well. That was an aha moment when I realized these folks know something, so here I am today - an actual Product Engineer. Besides my day job, I have an unusual hobby – searching for truffles with my truffle dog.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-06-12",
      "teams": [
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30832,
      "name": "Daniel Escribano",
      "firstName": "Daniel",
      "lastName": "Escribano",
      "role": "Clickhouse Engineer",
      "location": "Spain",
      "country": "ES",
      "latitude": 39.3260685,
      "longitude": -4.8379791,
      "formattedAddress": "España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1719844548/daniel_b98412847a.png",
      "biography": "I was born in Madrid and here I am after 33 years writing this little bio so you can get to know me better.\n\nMy first contact with computers was at 11 when I was gifted a Pentium 3 for Christmas. I remember spending some time with it every day, even though I did not have Internet access until several years later. It's hard to imagine myself not accessing Internet from any computer device today!\n\nBefore joining Posthog I've been working as a Data Engineer in several companies. I remember that I started working with data almost accidentally... and here I am, helping with ClickHouse a couple of years later!\n\nOn the personal side of things, I really like to spend time in nature, doing some calisthenics (beginner level though, my challenge is achieving the first muscle-up), a bit of reading (fantasy and historical novel mostly) and now trying to improve my cooking skills.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-06-17",
      "teams": [
        {
          "id": 129,
          "name": "ClickHouse",
          "slug": "clickhouse"
        }
      ],
      "leadTeams": [
        {
          "name": "ClickHouse"
        }
      ]
    },
    {
      "id": 30833,
      "name": "Leon Daly",
      "firstName": "Leon",
      "lastName": "Daly",
      "role": "TAM called Leon",
      "location": "Amsterdam, Netherlands",
      "country": "NL",
      "latitude": 52.3730796,
      "longitude": 4.8924534,
      "formattedAddress": "Amsterdam, Noord-Holland, Nederland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1719843298/leon_1_821b9eed32.png",
      "biography": "They say Irish people have \"the gift of the gab\" or in other words, the ability to talk a lot, so naturally a career in Sales felt right. \n\nI try to spend as much time as I can outside playing sport, hiking, running, golfing (very badly) \nTo keep myself accountable, my handicap is currently 22. Please bring this up if we ever meet. I also want to run a sub 4 marathon by the end of 2026, please also ridicule me if I have not done this.\n\nBeing Irish, and travelling extensively, means I have met people from all walks of life, and people have a tendency to feel comfortable around Irish people, which has led to me making friends across the world - this friendly and approachable nature is what has allowed me to have success in my sales career so far. I'm actively trying to break the mold and bad rep Salespeople have, especially in Tech!\n\nMy universe is currently centered around my Golden Retrevier ~puppy~ , Murphy, who is ~7 months old~ 2 years old at the time of writing this!\n\nMy role at Posthog is to help customers get the most from the entire platform, and support them as Posthog continues to add more products to our lineup!",
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-06-17",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30942,
      "name": "Oliver Browne",
      "firstName": "Oliver",
      "lastName": "Browne",
      "role": "Software Engineer",
      "location": "Finland",
      "country": "FI",
      "latitude": 63.2467777,
      "longitude": 25.9209164,
      "formattedAddress": "Suomi / Finland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1720026243/oliver_1_c253886ac0.png",
      "biography": "I'm Irish, an electronic/computer engineer, a decent skier, a passable woodworker, a bad photographer and a worse guitarist. I've been writing code since I was about 13, when my father made the mistake of letting me put ubuntu on the family computer, although I did take a brief detour through hardware design in university. After seeing up close how fast modern chips are, I decided to spend my career on \"this shouldn't take this long\", although more recently I've also added \"this shouldn't crash this often\" to the hit list.\n\nAfter university I spent a couple of years wandering around Ireland, then moved to the Austrian alps for a while, and now the Finnish lake-lands. These days, I spend my time building furniture, learning Finnish (slowly!), taking pictures with cameras older than me, and, of course, trying to make posthogs data plane more reliable, lower latency, and up to whatever mad experiment the product folks dream up next.",
      "color": "lilac",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2024-07-01",
      "teams": [
        {
          "id": 130,
          "name": "Error Tracking",
          "slug": "error-tracking"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 30974,
      "name": "Anirudh Pillai",
      "firstName": "Anirudh",
      "lastName": "Pillai",
      "role": "Software Engineer",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1721841362/Anirudh_1_ca21f6882d.png",
      "biography": "When I first discovered programming, it was like having superpowers. I could create things and make the pixels look exactly as I wanted - imagination was the limit. I could then keep optimising things. Learn something new, apply the new superpowers, celebrate the results, repeat!\n\nFast forwarding a decade of using these superpowers, with a stopover at UCL (where I met other epic builders), I'm now building awesome things at PostHog.\n\nThings that keep me away from the screen include:\n- Reading\n- Football (both playing and watching COYG!)\n- Hiking\n- Discovering new restaurants every weekend\n",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-07-05",
      "teams": [
        {
          "id": 118,
          "name": "Product Analytics",
          "slug": "product-analytics"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31090,
      "name": "Anna Szell",
      "firstName": "Anna",
      "lastName": "Szell",
      "role": "Product Manager",
      "location": "Budapest",
      "country": "HU",
      "latitude": 47.4813896,
      "longitude": 19.1460941,
      "formattedAddress": "Budapest, Közép-Magyarország, Magyarország",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196807/Anna_f105586303.png",
      "biography": "After spending most of my adult life digging into data, I decided to switch to product management only to realize that I'm still mainly just looking at charts and writing SQL. I'm definitely not mad about it, and I'm happy to complement this by occasionally speaking with a human being about our product. So if you have something to say, [let me know](https://cal.com/anna-posthog/posthog-user-interview)!\n\nOutside of work, you can mostly find me on a plane en route to either the beach or the Alps. I love snowboarding, collecting special edition books (also reading them), and all dogs.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-07-22",
      "teams": [
        {
          "id": 118,
          "name": "Product Analytics",
          "slug": "product-analytics"
        },
        {
          "id": 119,
          "name": "Web Analytics",
          "slug": "web-analytics"
        },
        {
          "id": 116,
          "name": "Data Stack",
          "slug": "data-stack"
        },
        {
          "id": 152,
          "name": "Analytics Platform",
          "slug": "analytics-platform"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31138,
      "name": "Abigail Richardson",
      "firstName": "Abigail",
      "lastName": "Richardson",
      "role": "Technical Support Engineer",
      "location": "Ireland",
      "country": "IE",
      "latitude": 52.865196,
      "longitude": -7.9794599,
      "formattedAddress": "Éire / Ireland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1724774726/Abigail_607ecbe510.png",
      "biography": "Where am I from? Who even knows!\n\nI was born in Scotland to English parents, grew up in Belgium at an international school, went to the University of York UK, spent an industrial placement year in Germany, worked in Bath UK for 10 years, and now I live in Ireland.\n\n\nHow did I get here?\n\nWell…when I was little, I wanted to be a vet. When I was older, I thought about studying genetics and psychology or maybe bio-chemistry. In the meantime, I was spending a bunch of my free time in the theatre designing and constructing sets, plus working backstage on the sound design. I worked at both the National Student Drama Festival and the Edinburgh Fringe Festival.\n\n\nSo, what actually did happen?\n\nInspired by my theatre work, I studied Electronic Engineering with Music Technology Systems and discovered that I thoroughly enjoyed our\nprogramming-related modules.\n\n\nDuring my career I have been a dev, a technical analyst, and technical support person. I have experienced companies of various sizes and have experienced two company acquisitions. I love problem solving - and helping people and improving the way we work is my jam.\n\n\nIn my spare time you'll find me playing games (tabletop, computer or console), painting PostHog logos on my nails, or wrapped up with my latest crochet project.",
      "color": "lilac",
      "pronouns": "she/her",
      "pineappleOnPizza": true,
      "startDate": "2024-07-29",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": [
        {
          "name": "Support"
        }
      ]
    },
    {
      "id": 31139,
      "name": "Scott Sowers",
      "firstName": "Scott",
      "lastName": "Sowers",
      "role": "Sales & Customer Success",
      "location": "San Francisco",
      "country": "US",
      "latitude": 37.7792588,
      "longitude": -122.4193286,
      "formattedAddress": "San Francisco, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1724774703/Scott_69d4d8d234.png",
      "biography": "PHP was my first venture into \"programming,\" which I learned in middle school to build a web portal for my scout troop and that I never actually launched. \n\nFrom there, I ventured into C, and after a lot of memory leaks, tried my hand at assembly language. The memory leaks were gone (I think), but it was tedious and I spent three months getting a microprocessor to work with a keypad an a magnetic sensor.\n\nFrom there I dabbled in C# for a bit, convinced that Silverlight was going to be the way of the future, before moving back to PHP and eventually settling on JavaScript and Python.  \n\nIt was clear no one would ever pay me to write code for a living, so I moved into sales.\n\nHopefully I never have to write a line of APEX.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-07-29",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31541,
      "name": "Bryan Ciaraldi",
      "firstName": "Bryan",
      "lastName": "Ciaraldi",
      "role": "Site Reliability Engineer",
      "location": "Northern California",
      "country": "US",
      "latitude": 37.7867337,
      "longitude": -122.4309337,
      "formattedAddress": "Japanese Cultural and Community Center of Northern California, 1840, Sutter Street, Japantown, Western Addition, San Francisco, California, 95115, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1727799155/Bryan_799abde1ff.png",
      "biography": "Howdy, Bryan/B/BryGuy here! \n\nI'm a digital plumber and whichwayer by day, a family man and obstacle course constructor by night. I love to tweak and tinker with all things platform-related. My career direction was driven by my passion for digging into the details, understanding how things work, and ensuring they run smoothly.\n\nWhen I'm not building and/or breaking platforms, you'll find me with the family, doing experiments, watering ~~each other~~ the garden, or just generally trying to keep up and catch my breath.",
      "color": "orange",
      "pronouns": "He/Him",
      "pineappleOnPizza": true,
      "startDate": "2024-09-18",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31567,
      "name": "Ben Lea",
      "firstName": "Ben",
      "lastName": "Lea",
      "role": "Support Engineer",
      "location": "Croatia",
      "country": "HR",
      "latitude": 45.3658443,
      "longitude": 15.6575209,
      "formattedAddress": "Hrvatska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1728482366/Ben_L_a3ac90960f.png",
      "biography": "I started programming in visual basic in college and realised immediately it was was really cool. Being a gamer also I went on to study Games Programming at university and realised pretty quickly that I should keep enjoying the hobby! \n\nPretty soon after that I broke into the world of tech and realised I could instead combine my programming skills with the customer service skills I gained from various jobs to do support engineering. \n\nSince then I have found my passion lies in using my programming knowledge to  deliver great customer support experiences, improve processes and automate workflows.  ",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-09-23",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31566,
      "name": "Patricio Tarantino",
      "firstName": "Patricio",
      "lastName": "Tarantino",
      "role": "Billing Engineer",
      "location": "Argentina",
      "country": "AR",
      "latitude": -34.9964963,
      "longitude": -64.9672817,
      "formattedAddress": "Argentina",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1727799155/patricio_5aa29ef597.png",
      "biography": "I'm from Buenos Aires, Argentina, where I earned an incomplete half-degree in Mathematics and a Master’s Degree in Computer Science, although they don’t seem to hold much value now. I’ve been working with computers since I was 10 years old (my first website was created with Netscape Composer), and I haven’t stopped since.\n\nI’m a big fan of San Lorenzo, a football (soccer) team from Argentina, and I’ve traveled to various countries to see them play, with my furthest trip being to Morocco in 2014 for the FIFA Club World Cup. I’ve also traveled abroad for concerts, and one of my hobbies is collecting books, including first editions, rare editions, proof copies, and signed copies.\n\nI live with my wife, Belén, and our little dog, Cappuccina (though I’m not a fan of coffee, you can guess who chose her name).\n\nP.S. I technically have a selfie with Bob Dylan.",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-09-23",
      "teams": [
        {
          "id": 141,
          "name": "Billing",
          "slug": "billing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31540,
      "name": "Ben Haynes",
      "firstName": "Ben",
      "lastName": "Haynes",
      "role": "Technical Support Engineer",
      "location": "Massachusetts",
      "country": "US",
      "latitude": 42.3788774,
      "longitude": -72.032366,
      "formattedAddress": "Massachusetts, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1728482424/ben_h_8fd5ee8b8b.png",
      "biography": "Hello! I'm Ben. Not to be confused with [this Ben](https://posthog.com/community/profiles/30205)... or [this Ben](https://posthog.com/community/profiles/31567)... or [this Ben](https://posthog.com/community/profiles/32367)... or [this Ben](https://posthog.com/community/profiles/35123)... Actually it may just be easier to call me 'Haynes', most people do! I am originally from Winchester in the United Kingdom, but now reside in Massachusetts in the USA.\n\nFrom an early age, I learned how to break various pieces of technology, mainly the family desktop computer. As a result I had to quickly learn how to fix them again. Getting older, I realized I could break things (and fix them) much easier using code and so my programming journey began.\n\nMy career started supporting the computer systems on television gameshows across the world, before moving into a business that provided broadcasting solutions for sporting events. Here I really fleshed out my knowledge of coding, developing a bespoke all-in-one support and scheduling system. \n\nWhen not working on your tickets, you can find me viewing or partaking in various sports, tidying my sneaker collection or trying to introduce my American wife to British TV panel shows she has no interest in watching.\n\nI am also the [Chief Hedgehog Feeder](https://posthog.com/handbook/support/customer-support#csat-surveys) of PostHog, so please submit your support surveys!",
      "color": "purple",
      "pronouns": "He / Him",
      "pineappleOnPizza": false,
      "startDate": "2024-09-23",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31730,
      "name": "Ioannis Josephides",
      "firstName": "Ioannis",
      "lastName": "Josephides",
      "role": "Mobile Engineer",
      "location": "Cyprus",
      "country": "CY",
      "latitude": 34.9174159,
      "longitude": 32.8899027,
      "formattedAddress": "Κύπρος, Κύπρος - Kıbrıs",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1728482335/Yiannis_2d47478082.png",
      "biography": "I grew up in a loving family in the quiet suburbs of Nicosia, Cyprus, spending my time noodling on my guitar and causing trouble for my family and neighbors. Shortly after, I found myself building cool stuff for mobile, specifically on Apple devices, and turned that into a career.\n\nProud ex-founder of two app startups that flopped, I’ve got the scar tissue to prove my willingness to dive into new adventures, breaking things apart and combining the pieces to build something new. I will always embrace the creative chaos!\n\nThese days, I’m hopelessly obsessed with my two little chaos agents and probably get a bit too annoying talking about them all the time.\n\nOh, and for the record, pineapples are yummy when not on a pizza.\n",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-10-07",
      "teams": [
        {
          "id": 157,
          "name": "Mobile",
          "slug": "mobile"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31731,
      "name": "Danilo Campos",
      "firstName": "Danilo",
      "lastName": "Campos",
      "role": "Technical Content Marketer",
      "location": "United States",
      "country": "US",
      "latitude": 39.7837304,
      "longitude": -100.445882,
      "formattedAddress": "United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1730314839/Danilo_1_c90574519c.png",
      "biography": "I spent my childhood getting my hands on every single piece of software that could fit through a 33.6kbps modem connection. This didn't usually include documentation, but I learned what I could to be productive across everything from networking tools to motion graphics to 3D design.\n\nIt was an accidental course of study in software, product design and computing, and I resented every distraction from it. Who needs cursive writing?!\n\nBetween all that context and a love of self-directed learning, I had everything I needed for a career in software. Teaching myself iPhone development in 2008, I quit a safe job in the middle of the financial crisis to find a career worth having.\n\nI've led mobile at multiple startups, including two at the seed stage. *Pour one out for Hipmunk.*\n\nI love the intersection of product design and engineering. But most of all, I feel a debt to make sure everyone who wants to learn can have the same leverage that I found in my career.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-10-09",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31771,
      "name": "Ross Gray",
      "firstName": "Ross",
      "lastName": "Gray",
      "role": "Product Engineer",
      "location": "Bath, UK",
      "country": "GB",
      "latitude": 51.3813864,
      "longitude": -2.3596963,
      "formattedAddress": "Bath, Bath and North East Somerset, West of England, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196081/Ross_5873f9452f.png",
      "biography": "I got into software somewhat unexpectedly when I was at university studying engineering. During my first software engineering class I realised that there was something about solving problems and writing code that just seemed to click with me (which is a good thing, as I have no idea what I would have done otherwise)!\n\nSince then, I've worked at a number of companies, both large and small (though massively preferring the latter) in a variety of different industries. I am not too tied to one particularly technology; the problems being solved and the team I am working with are far more important to me. I love being in an environment where I am surrounded by talented, passionate and kind people, and a healthy company culture, all of which brought me to PostHog 🙂\n\nI have been lucky to live in several places across the world, but am currently based in the beautiful city of Bath.\n\nIn my free time I like playing golf ⛳️, listening to music 🎧, gardening 🌻 and working on side projects 👨‍💻 (the emphasis here is on ‘like’ as I actually spend most of my time trying to keep my son entertained).",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-10-21",
      "teams": [
        {
          "id": 135,
          "name": "Batch Exports",
          "slug": "batch-exports"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 31993,
      "name": "Michael Kutsch",
      "firstName": "Michael",
      "lastName": "Kutsch",
      "role": "Site Reliability Engineer",
      "location": "Munich",
      "country": "DE",
      "latitude": 48.1371079,
      "longitude": 11.5753822,
      "formattedAddress": "München, Bayern, Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196185/Michael_K_bf0022aba2.png",
      "biography": "I'm Michi and SRE @ Posthog. \n\nBefore starting here, I worked at two other places where I did - surprise! - different things. \nAfter working for a longer time for a startup in all kind of IT roles (support, frontend, backend, datawarehouse, cloud...), I took a 7 year detour to consulting, where I jumped into cloud infra topics, cloud architecture and DevOps all around AWS and k8s. \nAfter discovering Posthog, I applied and here I am! \n\nWhen not tweaking the clouds and clusters, I love listening to music, play some computer games, board games with my kids or automate my home. \n\n",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-11-01",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": [
        {
          "name": "Infrastructure"
        }
      ]
    },
    {
      "id": 31785,
      "name": "Haven Barnes",
      "firstName": "Haven",
      "lastName": "Barnes",
      "role": "Product Engineer",
      "location": "TX",
      "country": "US",
      "latitude": 31.2638905,
      "longitude": -98.5456116,
      "formattedAddress": "Texas, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196235/Haven_f5db107d17.png",
      "biography": "I'm Haven, sometimes mistakenly called Heaven, Hayden, David, etc. I'm a fullstack software engineer currently focusing on making a [PostHog Messaging product](https://posthog.com/teams/messaging)\n\nSome of the things I love:\n- Making complex systems simple, observable, and explainable\n- Profiling frontend and backend applications (yes, really!)\n- The Pacific Northwest \n- Movies ([follow me on Letterboxd](https://letterboxd.com/havenb3))\n- Playing basketball at an aggressively amateur level\n\nSome of the things I don't love:\n- Being in the \"this doesn't seem possible\" phase of a bug investigation\n- The general concept of renting\n- Being unable to increase my Rocket League competitive rank",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-11-04",
      "teams": [
        {
          "id": 143,
          "name": "Workflows",
          "slug": "workflows"
        }
      ],
      "leadTeams": [
        {
          "name": "Workflows"
        }
      ]
    },
    {
      "id": 32051,
      "name": "Steven Truong",
      "firstName": "Steven",
      "lastName": "Truong",
      "role": "Technical CSM",
      "location": "Greater Seattle Area, WA",
      "country": "US",
      "latitude": 47.6038321,
      "longitude": -122.330062,
      "formattedAddress": "Seattle, King County, Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196285/Steven_b103bf93ca.png",
      "biography": "In another lifetime, I was studying to become a pharmacist. Instead, I ended up in tech and co-founded my first startup. Since then, I've grown a love for startups and have spent most of my career in them.\n\nOriginally from Portland, Oregon, I lived in San Francisco and the Bay Area for a time before moving back north and settling in the Greater Seattle Area. I'm married with four kids.\n\nWhen I'm not working, spending time with family and friends, or writing code, I enjoy reading, catching up on the news, and researching. Though I don't do them often enough, my hobbies include traveling, snowboarding, woodworking, 3D printing, and tinkering with electronics.",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-11-11",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32112,
      "name": "Scott Lewis",
      "firstName": "Scott",
      "lastName": "Lewis",
      "role": "Executive Assistant",
      "location": "London, UK",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196309/Scott_f66e1d0664.png",
      "biography": "I've been in a few different corners of tech. I started at  working on product launches, briefly left to join the circus (don’t ask, lockdown was weird), which led me to Netflix where I mapped content across their global slate. Most recently, I was at Europe’s largest Series A VC fund, helping scale portfolio companies from the ivory tower – cap tables, data rooms and fundraises. It was awesome, but I had too much fomo watching founders build things… now I’m on the PostHog rocketship and it’s unreal.\n\nHere I support our co-founders, James and Tim, across whatever will move the company forward - sometimes strategic, sometimes scrappy, sometimes just wrangling chaos so things actually keep moving and feel unblocked. A few things I’ve been responsible for here:\n- Organizing our Series D and E fundraising\n- Opening Hogpatch from zero to launch\n- Running our YC and startup deals\n- SF billboard campaigns and merch shoots\n\nI’m intentionally a generalist - it’s a legitimate technical skill, not a gap. I take a vague brief and figure things out on the fly more often than not. Variety keeps me engaged (vs distracted) and I’m happiest on insanely steep learning curves, stretching the edges of my role as we grow.\n\nOutside work, I love trying new things purely for the fun of it. I get *very* into random hobbies – rollerblading is the current one – and commit with a delusional obsession. I once convinced myself I could become an Olympic beach volleyballer… and somehow ended up at an Olympic training camp. Zero regrets. My 2025 vision board also said “*do an improv class (Michael Scott style)*” – I did that in SF recently. Mortifying, yup. I will never see those people again and that’s a blessing.\n\n#### Personal ranking of Celebrations chocolates to see if we'll be immediate friends:\n1. Bounty\n1. Milky Way\n1. Galaxy\n1. Maltes—oh wait, Bounty was my #1 which means you've probably closed the tab already",
      "color": "lilac",
      "pronouns": "he/him/his",
      "pineappleOnPizza": true,
      "startDate": "2024-11-12",
      "teams": [
        {
          "id": 120,
          "name": "Blitzscale",
          "slug": "blitzscale"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32207,
      "name": "Rafael Audibert",
      "firstName": "Rafael",
      "lastName": "Audibert",
      "role": "Product Engineer",
      "location": "Porto Alegre",
      "country": "BR",
      "latitude": -30.0324999,
      "longitude": -51.2303767,
      "formattedAddress": "Porto Alegre, Região Geográfica Imediata de Porto Alegre, Região Metropolitana de Porto Alegre, Região Geográfica Intermediária de Porto Alegre, Rio Grande do Sul, Região Sul, Brasil",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736191108/Rafael_af69844ecd.png",
      "biography": "Hey, I'm Rafa, I'm based in Brazil, love gaming, hiking, traveling, and spending a good time with my fiancée and our lovely cat, Aura. I also really love to chat, just ping me, email me, DM me, whatever.\n\nI don't know exactly when I chose to become a software developer. I think I just typed very fast when I was a kid, and I thought I could make that a job, then at 15 I learned me some C++, done, software developer it is. Just for the funsies I got a _summa cum laude_ bachelor's degree in CompSci, hopefully, the most useless achievement I'll ever get. I also got into competitive programming while I was at college, but I wasn't at *that* level, did get to the Brazilian finals, though!\n\nWorked in a couple of startups as an early employee in the past, none with major success, here's to Posthog becoming my first IPO! I've worked with a lot of cool tech: Rails, Django, React, GraphQL, Postgres, etc. On the side I've done cool stuff with Dart + Flutter, Rust, C++ as well, but don't ask me for help on that kind of stuff. Really looking forward to learning more stuff here at Posthog such as Clickhouse, actual useful Rust, Kafka, etc.\n\nMy favorite toy when I was a kid was a hedgehog, and I have it to this day, it's called Pock (comes from the translation of hedgehog to Portuguese, _Porco-Espinho_, you can get to Pock with some imagination). I guess Posthog was meant to be.\n\n",
      "color": "seagreen",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2024-11-25",
      "teams": [
        {
          "id": 144,
          "name": "Revenue Analytics",
          "slug": "revenue-analytics"
        },
        {
          "id": 121,
          "name": "Growth",
          "slug": "growth"
        }
      ],
      "leadTeams": [
        {
          "name": "Revenue Analytics"
        },
        {
          "name": "Growth"
        }
      ]
    },
    {
      "id": 32193,
      "name": "Adam Leith",
      "firstName": "Adam",
      "lastName": "Leith",
      "role": "UX Platform Engineer",
      "location": "UK",
      "country": "GB",
      "latitude": 54.7023545,
      "longitude": -3.2765753,
      "formattedAddress": "United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736196359/Adam_1d1a92fd84.png",
      "biography": "I spent a lot of my career working in startup ad-tech companies building landing pages and sign up flows- learning UX the dark way- making legal print too small etc... That was my dark past, I am now a self proclaimed beacon of user-focused-light. I now live to make things beautiful, legible, and useable. \n\nWhat's the light without the darkness?\n\nPineapple on burgers, thoughts?",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-11-26",
      "teams": [
        {
          "id": 137,
          "name": "Platform UX",
          "slug": "platform-ux"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32260,
      "name": "Anders Asheim Hennum",
      "firstName": "Anders",
      "lastName": "Asheim Hennum",
      "role": "Product Engineer",
      "location": "Norway",
      "country": "NO",
      "latitude": 61.1529386,
      "longitude": 8.7876653,
      "formattedAddress": "Norge",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1737141486/Anders_8ca21dd578.png",
      "biography": "* from Valdres in Norway and live in Sogndal now (mountains and fjords!)\n* spend a lot of time outdoors (climbing, skiing, running, biking)\n* linux nerd since childhood (you should have seen my 3d compiz desktop)\n* lived two years in northern Norway just to have fun outdoors\n* had an internship at Svalbard and a saw a polar bear from my office\n* have a master degree in applied physics and mathematics from NTNU and specialized in statistics\n* joined an online grocery startup ([oda.com](https://oda.com)) after university which was a lot of fun and stayed there for 8 years (my only full-time job before PostHog)\n* own a Kawasaki Ninja\n* like to play board games and discuss philosophy\n* my family is big and I love to spend time with them",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-12-03",
      "teams": [
        {
          "id": 133,
          "name": "Experiments",
          "slug": "experiments"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32302,
      "name": "Pawel Szczur",
      "firstName": "Pawel",
      "lastName": "Szczur",
      "role": "Product Engineer",
      "location": "Olsztyn, Poland",
      "country": "PL",
      "latitude": 53.776644,
      "longitude": 20.4777531,
      "formattedAddress": "Olsztyn, powiat olsztyński, województwo warmińsko-mazurskie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736970145/Pawel_56599d5a70.png",
      "biography": "I enjoy bit and byte shifting since I've been 12. I've been around data processing for the last 15 years. I think it's pretty cool what we can express by code. I've flipped bytes in Nokia, Google/YouTube, OLX and Oxla. I've been in few startups before but PostHog is really something new for me.\n\nI play board games and sometimes a bit of retro gaming. I 3d print for fun.\n\nI live in a quiet Olsztyn/Poland with my family. I bike all year around with kids in my Urban Arrow.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2024-12-09",
      "teams": [
        {
          "id": 129,
          "name": "ClickHouse",
          "slug": "clickhouse"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32304,
      "name": "Peter Kirkham",
      "firstName": "Peter",
      "lastName": "Kirkham",
      "role": "Product Engineer",
      "location": "San Francisco, CA",
      "country": "US",
      "latitude": 37.7792588,
      "longitude": -122.4193286,
      "formattedAddress": "San Francisco, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1738351844/Peter_K_db7796d2d5.png",
      "biography": "I'm not a fan of writing about myself, so I will share some quotes of what others have said about me:\n\n*\"Likely first CEO of Mars\" - Forbes*  \n*\"Peter is an engineering superhero, trust me, I would know\" - Clark Kent*  \n*\"There is no bug he can't fix or problem he can't solve\" - Peter's manifestation journal*  \n*\"The smartest person I've ever worked with\" - an definitely real ex colleague*  \n*\"A very handsome young man\" - my nana*  \n*\"Artificially intelligent\" - Matt, my brother*  \n*\"Has never made up false quotes about himself\" - Verified fact checkers*  ",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-12-09",
      "teams": [
        {
          "id": 158,
          "name": "Array",
          "slug": "array"
        }
      ],
      "leadTeams": [
        {
          "name": "Array"
        }
      ]
    },
    {
      "id": 32367,
      "name": "Ben Bradley",
      "firstName": "Ben",
      "lastName": "Bradley",
      "role": "Sales Team Lead",
      "location": "Kansas City",
      "country": "US",
      "latitude": 39.100105,
      "longitude": -94.5781416,
      "formattedAddress": "Kansas City, Jackson County, Missouri, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1736970175/Ben_B_725093cbf7.png",
      "biography": "I am a native Kansan who will absolutely find a way to work that in to *almost* every conversation, so buckle up.\n\nI've also lived on the U.S. East Coast and traveled widely, but I'm back in the greater Kansas City area (Kansas side) with my wife Sarah, son, and daughter. \n\nI was previously at [WordPress VIP](https://wpvip.com/) (Enterprise WordPress), where I helped engineering and product teams achieve scalable, secure, and reliable WordPress implementations. Before VIP, I worked in media (The Atlantic, PBS NewsHour) and institutional nonprofits (Pew, Kauffman) usually doing digital product work with engineers. In those roles, which were in the days of yore, I would've loved PostHog.\n\nI love light banter, [the Tallgrass Prairie](https://www.nps.gov/tapr/index.htm), reading the documentation, and the idea of cycling more. When I'm not online, I'm typically chasing (or being chased by) kids or a dog...hopefully my own dog.",
      "color": "salmon",
      "pronouns": "He/Him",
      "pineappleOnPizza": false,
      "startDate": "2024-12-16",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": [
        {
          "name": "New Business Sales"
        }
      ]
    },
    {
      "id": 32387,
      "name": "Lucas Faria",
      "firstName": "Lucas",
      "lastName": "Faria",
      "role": "Product Engineer",
      "location": "Brazil",
      "country": "BR",
      "latitude": -10.3333333,
      "longitude": -53.2,
      "formattedAddress": "Brasil",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1737766204/Lucas_4c1aeaa135.png",
      "biography": "How do people describe me:\n\n- Sometimes obsessive\n- Overly optimistic\n- Looks at screens for way too many hours\n\nYeah, I got addicted to computers pretty young due to Tibia and Ragnarok Online 😅\n\nThat's actually how I learned to speak english!\n\nAnyway, I'm Lucas, a Brazilian engineer who loves coding, animals, books and nature. [My full about page is here](https://lucasfaria.dev/about).\n\nI also [publish a newsletter](http://newsletter.nagringa.dev/) for Brazilian engineers, if you're looking to get some career insights.\n\nI don't know how did I get here, but I'll try my best to teach you everything I learn along the way.",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2024-12-19",
      "teams": [
        {
          "id": 132,
          "name": "Surveys",
          "slug": "surveys"
        }
      ],
      "leadTeams": [
        {
          "name": "Surveys"
        }
      ]
    },
    {
      "id": 32500,
      "name": "Paweł Ledwoń",
      "firstName": "Paweł",
      "lastName": "Ledwoń",
      "role": "Product Engineer",
      "location": "Warsaw",
      "country": "PL",
      "latitude": 52.2333742,
      "longitude": 21.0711489,
      "formattedAddress": "Warszawa, województwo mazowieckie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1738351859/Pawel_L_2d1a455ece.png",
      "biography": "I started programming when I was 12, when my parents brought home our first 56K modem. I honestly can't figure out what I did with my childhood before that. I coded throughout high school and eventually went for a degree in Computer Science at the University of Wrocław in Poland. During the first year of my master's program, I decided it would be cool to join a startup for a year and then return to finish my studies. Now, I have a bachelor's degree in Computer Science.\n\nI've spent almost a decade helping to move events between clouds, so it should come as no surprise that at PostHog, I work on the CDP team. I love working on busy services with high reliability requirements.\n\nMy biggest software engineering achievement is the `AssistantToTheTransportManager` class that over five years of its existence made its way to tens of millions of web browsers. My biggest disappointment is not being able to make \"crunchy frogs\" a thing in programming.\n\nAside from software engineering, I try to escape to the mountains as often as I can. My favorite travel memories are treks in the Himalayas and Andes, as well as a (too) spontaneous bikepacking trip through Patagonia. I also spend a lot of time running and bouldering. Despite all that time spent exercising, I probably hold the title for the least fit person ever featured on Eurosport.",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": null,
      "startDate": "2025-01-06",
      "teams": [
        {
          "id": 145,
          "name": "Ingestion",
          "slug": "ingestion"
        }
      ],
      "leadTeams": [
        {
          "name": "Ingestion"
        }
      ]
    },
    {
      "id": 32498,
      "name": "Aleks Veryayskiy",
      "firstName": "Aleks",
      "lastName": "Veryayskiy",
      "role": "Product Engineer",
      "location": "Budapest",
      "country": "HU",
      "latitude": 47.4813896,
      "longitude": 19.1460941,
      "formattedAddress": "Budapest, Közép-Magyarország, Magyarország",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1737766160/Aleksandr_0d2098b9d4.png",
      "biography": "Born in the USSR, I first touched a computer in 1993—an Intel 486 running DOS. In high school, my brother and I got our first shared personal PC, an Intel Pentium 166. Spent hours playing Fallout and Heroes of Might and Magic. Then one day, I went to a bookstore to buy a book on “how to program games.” Haven’t played games much since.\n\nIn 2012, I became a digital nomad. I wrote a book, [Digital Nomad Life: Ultimate Guide](https://veryayskiy.gumroad.com/l/book), which got featured in Portuguese news. Since then, I’ve traveled to 46 countries and lived in 7 of them. Recently, I moved from the Netherlands to Hungary.\n\nIn 2020, I wanted to learn about AI, so I decided to build a “Vivino but for coffee.” That project brought me into the world of specialty coffee, and just a couple of years later, I found myself picking coffee in the mountains of Chiang Mai, Thailand.\n\nIn total, I’ve built 20+ projects, failing at most of them. One of them, [AI business plan generator](https://bizplanner.ai), led me to discover PostHog. I loved it from day one and even built a few things on top of it just for fun.\n\nNow, I own way more coffee tools than I need. I’m training for an Ironman and still dreaming of integrating my Raspberry Pi into a coffee machine.\n\nIf you have any ideas how to make [Session Replay](https://posthog.com/session-replay) product better - please text me!",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-01-06",
      "teams": [
        {
          "id": 124,
          "name": "Replay",
          "slug": "replay"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32501,
      "name": "Phil Haack",
      "firstName": "Phil",
      "lastName": "Haack",
      "role": "Product Engineer",
      "location": "Washington",
      "country": "US",
      "latitude": 38.8950368,
      "longitude": -77.0365427,
      "formattedAddress": "Washington, District of Columbia, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1737766226/Phil_80d0af4842.png",
      "biography": "My name is Phil Haack, pronounced \"fill hack\", and I know what you're thinking, what a great name for a software engineer, Phil!\n\nGrowing up, the US Air Force deemed it necessary to move my family to new places every three or so years. Places such as: Michigan (upper peninsula), Okinawa, Florida (Tampa), Spain (Torrejon), Guam, Alaska.\nI bet that had a big impact on the way I see the world, hopefully in a good way.\n\nAfterwards, I moved to California (Los Angeles) for college. While there, I did a study abroad program in Budapest, Hungary for a few months, so I count that as a place that I lived. Some time after college, I moved to Washington to work at Microsoft.\n\nI've had the good fortune to travel to many more places. One of my favorite ways to travel is to give a talk at a conference in a country because I end up meeting so many locals.\n\nMuch of my career has been developing open source products and tools for developers. NuGet, ASP.NET MVC, and GitHub are some of the things I've worked on that are widely used. Prior to PostHog, I co-founded a start-up that built a chat bot that was going to take over the world so we had to put it down (the lack of product market fit also contributed to that outcome).\n\nFor fun I love to hang out with my kids, play soccer, ski, go boating, travel, and just enjoy life with other people.\n",
      "color": "blue",
      "pronouns": "He/Him",
      "pineappleOnPizza": false,
      "startDate": "2025-01-06",
      "teams": [
        {
          "id": 115,
          "name": "Feature Flags",
          "slug": "feature-flags"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32497,
      "name": "Joshua Snyder",
      "firstName": "Joshua",
      "lastName": "Snyder",
      "role": "Product Engineer",
      "location": "Cambridge",
      "country": "GB",
      "latitude": 52.2055314,
      "longitude": 0.1186637,
      "formattedAddress": "Cambridge, Cambridgeshire, Cambridgeshire and Peterborough, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1739802188/Joshua_2bf7988ece.png",
      "biography": "I live in Cambridge, UK and can sometimes be spotted running around in a silly-looking gown. Thankfully, my wife Hania and son Benio keep me company (and sane!).\n\nPreviously, I founded TimeNavi, a calendar-based time-tracking app that helped over 250,000 users understand their time. Building something from scratch and scaling it was a really fun experience and I learned a lot about the fun problems you encounter along the way scaling a codebase and a business. I was an early user of PostHog whilst working at TimeNavi, so it's great to be contributing to it from the inside now!\n\nOutside of work, you’ll find me travelling with the family, hiking and eating popcorn (like, a lot of popcorn! 🍿)\n\nP.S. Pineapple doesn’t belong on pizza, but you didn’t need me to tell you that, did you?",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-01-06",
      "teams": [
        {
          "id": 158,
          "name": "Array",
          "slug": "array"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32489,
      "name": "Meikel Ratz",
      "firstName": "Meikel",
      "lastName": "Ratz",
      "role": "Product Engineer",
      "location": "Munich",
      "country": "DE",
      "latitude": 48.1371079,
      "longitude": 11.5753822,
      "formattedAddress": "München, Bayern, Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1739802155/Miekel_5b29081a88.png",
      "biography": "I'm pretty much a Munich cliché when it comes to how I love spending my time: anything involving mountains—hiking, mountaineering, climbing, bouldering, via ferratas, skiing, or swimming in the nearby lakes—is my happy place. I’m also passionate about cycling, particularly bikepacking and long-distance rides. When it comes to food, I’m an unapologetic enthusiast (I like to think of myself as Italian by choice).\nWhen I’m not out adventuring, I’m recharging my introvert batteries with a good book, making amateur music, or writing songs that tend to have a melancholic vibe.\n\nWhat energizes me work-wise is shipping cool stuff with amazing people. It’s as simple as that. Having worked across companies of all sizes, I’ve discovered that my heart lies with small teams that have the autonomy to quickly bring their products into the hands of customers.\n\nFun Facts: I was the opener for a famous german rapper in my hometown once & played in the selection roster of the german lacrosse national team but didn't make the cut. ",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-01-06",
      "teams": [
        {
          "id": 143,
          "name": "Workflows",
          "slug": "workflows"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32596,
      "name": "Sean O'Shaughnessy",
      "firstName": "Sean",
      "lastName": "O'Shaughnessy",
      "role": "Account Executive",
      "location": "Orlando, FL",
      "country": "US",
      "latitude": 28.5421109,
      "longitude": -81.3790304,
      "formattedAddress": "Orlando, Orange County, Florida, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1742047555/Sean_O_6127865dfd.png",
      "biography": "I've always been drawn to technology—whether it was my first Nintendo or early PCs like Compaq and Packard Bell (complete with the iconic \"turbo\" button!) that I used for gaming and burning CDs.\n\nIn college, I met my closest friend who introduced me to Classic ASP for building websites. I too wanted to tinker with lines of code in EditPlus while rocking out to tunes on WinAmp!\n\nOver the years, I dabbled in ASP.NET, Python, Ruby on Rails, and eventually WordPress where I was part of a small team that built the first-ever PlayStation Blog. Back then, WordPress hosting wasn’t as ubiquitous as it is today, so I had to figure out how to deploy three RHEL servers and even learn what \"SSH\" was!\n\nThat experience kickstarted a decade-long journey into the command line as a Linux systems administrator, working in various capacities and projects. Eventually, I moved \"front-of-house\" to embrace solutions engineering roles, combining my technical expertise with customer focused problem-solving.\n\nI’m based in Orlando, FL, with my wife and our two amazing (and sassy) daughters building LEGO, playing Minecraft, or cheering on their gymanstics interest. When I’m not working or with family and friends, you can usually find me woodworking in the garage—assuming it’s not unbearably hot!",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-01-27",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32545,
      "name": "Dana Zou",
      "firstName": "Dana",
      "lastName": "Zou",
      "role": "Technical Customer Success Manager",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1742047454/Dana_b1e08c0410.png",
      "biography": "Born in Singapore, grew up in Shanghai, and now based in London. \n\nI am a Customer Success manager at PostHog, which is just a fancy way of saying I try to be helpful to our customers. \n\nIn a past life, I studied medicine to be a doctor. Then I realised I can be *more* helpful by showing people how to use technology to solve their problems more effectively (also hospital software is horrendous). \n\nWhen not working, I am climbing, skiing, or playing fetch with my cat, Binu.",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-02-03",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": [
        {
          "name": "Customer Success"
        }
      ]
    },
    {
      "id": 32635,
      "name": "Eli Reisman",
      "firstName": "Eli",
      "lastName": "Reisman",
      "role": "Data Platform Engineer",
      "location": "Seattle, WA",
      "country": "US",
      "latitude": 47.6038321,
      "longitude": -122.330062,
      "formattedAddress": "Seattle, King County, Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1744030094/eli_r_2ffa41dd53.png",
      "biography": "Longtime PNW dweller. I enjoy travel, good meals, long walks with my wife and our aged rat terrier, and hacking on distributed systems. Yes, I have opinions on  pizza toppings, but I keep them close to the vest for fear of retribution by the Pineapple Industrial Complex.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-02-10",
      "teams": [
        {
          "id": 145,
          "name": "Ingestion",
          "slug": "ingestion"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32997,
      "name": "Joshua Ordehi",
      "firstName": "Joshua",
      "lastName": "Ordehi",
      "role": "Support Engineer",
      "location": "Dominican Republic",
      "country": "DO",
      "latitude": 19.0974031,
      "longitude": -70.3028026,
      "formattedAddress": "República Dominicana",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1742047503/Joshua_O_129141412f.png",
      "biography": "People are an interesting bunch, one day you’re listening to metal and studying sociology the next decade you’re experimenting with art and coding bots, but still playing games (RPGs mostly) throughout all of it. That’s why it's fun to explore people, you’ll always learn something new. I found a great way to learn from people is to help them, you get a deep understanding of people by owning their problems, and being kinda sorta shy most times I figured a way to help them remotely, through the happiness of technology.\n\nThat’s what I like, people and things, and so my days are about finding ways to make them work together. I firmly believe in automation as a way for humans to express what matters the most to them, and getting better control over errors as a bonus.\n\nBut *beware the sword you cannot see*, technology, like anything in excess, can dull you out, so I strive for a balance, by balancing on my bike whenever I can, or jumping on one foot not so much because my kid demands it, but actually because I still find it engaging.",
      "color": "purple",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-02-17",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33065,
      "name": "Magda Olszewska",
      "firstName": "Magda",
      "lastName": "Olszewska",
      "role": "Onboarding Specialist",
      "location": "Spain",
      "country": "ES",
      "latitude": 39.3260685,
      "longitude": -4.8379791,
      "formattedAddress": "España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1742047527/Magda_1690bcdc10.png",
      "biography": "Born in Poland, currently based in the south of Spain.\n\nDespite being an art and literature lover, I have always been drawn to tech and wanted to understand what my developer colleagues do and what they’re talking about.\n\nI’m an empathetic creature who enjoys making others smile, so I added a human touch to technology and became deeply involved in Customer Experience and User Safety over the years.\n\nIn my free time, you’ll probably find me planning my next trip (I’m a big planning geek), booking concert tickets, listening to psychology podcasts, exploring modern art galleries, or discovering new specialty coffee spots. In the evenings, I’m usually catching up on movies while being trapped on the couch by my cat.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-02-24",
      "teams": [
        {
          "id": 150,
          "name": "Onboarding",
          "slug": "onboarding"
        }
      ],
      "leadTeams": [
        {
          "name": "Onboarding"
        }
      ]
    },
    {
      "id": 33028,
      "name": "Lucas Ricoy",
      "firstName": "Lucas",
      "lastName": "Ricoy",
      "role": "Product Engineer",
      "location": "Brazil",
      "country": "BR",
      "latitude": -10.3333333,
      "longitude": -53.2,
      "formattedAddress": "Brasil",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1743688592/lucas_r_55370e69b8.png",
      "biography": "I build and break things (sometimes intentionally) in the hope of making them better.\n\nAfter years of asking questions ranging from \"_How do we scale this to millions?_\" to \"_Why does this button look weird in Safari?_\", I spent a few years managing and leading teams. That was nice, but too exclusive. I love coding, designing systems, and creating solutions that make an impact—so I wanted to get back to that.\n\nNow, I get to build things again—ideally with a few hedgehogs in the UI.\n\nWhen I’m not coding, I’m usually reading books, tinkering with new ideas, diving into YouTube’s finest (and mostly random) videos, figuring out new DIY projects I’ll never do, or writing short stories.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-02-24",
      "teams": [
        {
          "id": 119,
          "name": "Web Analytics",
          "slug": "web-analytics"
        }
      ],
      "leadTeams": [
        {
          "name": "Web Analytics"
        }
      ]
    },
    {
      "id": 32934,
      "name": "Brian Young",
      "firstName": "Brian",
      "lastName": "Young",
      "role": "Growth Marketing Manager",
      "location": "Oregon",
      "country": "US",
      "latitude": 43.9792797,
      "longitude": -120.737257,
      "formattedAddress": "Oregon, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1743688576/Brian_63051407b1.png",
      "biography": "Hey there! I'm Brian and I focus on data-driven ads & landing pages that grow PostHog's reputation and user count (trust me on this - you want to be a part of PostHog's user count). I actually used PostHog as a Growth Manager to great effect in my last role, and that's a big part of why I'm here now - I truly believe in this product and think more growth and product teams should know about it. \n\nAnyway, when I'm not optimizing our ads and landing pages with witty copy and clever targeting, I spend my time oscillating between sunburns and tan lines. I live in a small mountain town and have found a great community of fellow remote workers who love to get out into the wild to recharge. You can find me with my friends most evenings and weekends riding bikes or snowboarding, followed by pizza and NA beers.",
      "color": "sky-blue",
      "pronouns": "he/him/his",
      "pineappleOnPizza": false,
      "startDate": "2025-02-26",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33138,
      "name": "Hugues Pouillot",
      "firstName": "Hugues",
      "lastName": "Pouillot",
      "role": "Product Engineer",
      "location": "France",
      "country": "FR",
      "latitude": 46.603354,
      "longitude": 1.8883335,
      "formattedAddress": "France",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1744030105/hughes_b260494f8c.png",
      "biography": "I started programming when I was 11 years old using LEGO Mindstorms. Being able to define simple instructions for a machine to follow was magical to me as a kid, and that magic remains, though the instructions have become slightly more sophisticated. Since then, I have learned a few languages, co-founded two companies, and discovered a passion for crafting products that improves our daily lives along the way.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-03-03",
      "teams": [
        {
          "id": 130,
          "name": "Error Tracking",
          "slug": "error-tracking"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 32748,
      "name": "Luke Belton",
      "firstName": "Luke",
      "lastName": "Belton",
      "role": "Technical Support Engineer",
      "location": "Bath, UK",
      "country": "GB",
      "latitude": 51.3813864,
      "longitude": -2.3596963,
      "formattedAddress": "Bath, Bath and North East Somerset, West of England, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1745851353/luke_b_99c162f1fb.png",
      "biography": "I grew up on the island of Guernsey (yes, it's better than Jersey) spending most of my time either in a swimming pool or in the sea, before moving to the UK to study Geology and then Engineering Geology.\n\nI got my first taste of writing code building maps with a command line tool called GMT and then modelling seismic waves in fracture zones around deep geological storage facilities for nuclear waste. I got hooked by this new way of solving problems and using code to automate everyday tasks as I started work as an engineering geologist. Hungry for more, I jumped across to the software world as a technical support engineer and then product manager for an error/performance monitoring product. I found that I loved the combination of problem solving and helping people to build better products, which led me to PostHog.\n\nI'm currently based in Bath, UK where I spend my free time running/cycling/swimming/hiking/rowing or fending off my wife's latest bid for us to get a puppy. I'm pretty good at getting out of my depth with an ambitious DIY project, ignoring repeated lessons that a) it's never as easy as it looks in the YouTube videos and b) I should really pay attention to the forums that say it's harder than it looks. Most holidays take us to the French Alps for skiing/hiking/cycling depending on the season!",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-03-10",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33208,
      "name": "Rodrigo Iloro",
      "firstName": "Rodrigo",
      "lastName": "Iloro",
      "role": "Product Engineer",
      "location": "Uruguay",
      "country": "UY",
      "latitude": -32.8755548,
      "longitude": -56.0201525,
      "formattedAddress": "Uruguay",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1746541804/rodrigo_l_174161bcbf.png",
      "biography": "Rodrigo has been coding long, through many trends and repositories,  \nSince furry creatures roamed the stars in well-known sci-fi stories.  \nHe's built up teams and shipped out code with skill and dedication,  \nYet still enjoys a pun or two in casual conversation.  \n\nOriginally from Buenos Aires, now by ocean breezy,  \nHe dwells in Punta del Este where the cat regime ain't easy.  \nBeneath their paws he toils away, unless they grant exemption,  \nTo shoot his bow, take photographs, or build Lego brick inventions.  \nHe also gulps down sci-fi books and films of grand dimensions,  \nAnd seeks the latte's perfect brew with careful, close attention.  \n\nHe's got a knack for math and code, with logic sharp and clear,  \nAnd stays ahead of trends and tools, adapting without fear.  \nHis debugging skills are sharp and quick, though sometimes full of flair,  \nHe tackles every challenge with a curious, knowing air.  \nIn frontend, backend, and systems too, he's always seeking more,  \nCurious about the next challenge, and open to what's in store.  ",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-03-10",
      "teams": [
        {
          "id": 133,
          "name": "Experiments",
          "slug": "experiments"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33209,
      "name": "Pawel Cebula",
      "firstName": "Pawel",
      "lastName": "Cebula",
      "role": "Product Engineer",
      "location": "Szczecin, Poland",
      "country": "PL",
      "latitude": 53.4298114,
      "longitude": 14.5928676,
      "formattedAddress": "Szczecin, województwo zachodniopomorskie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1745851406/pawel_c_fb8110bd59.png",
      "biography": "I grew up in Poland, in a city called Szczecin (good luck pronouncing that).\n\nWith no clear plan, I moved to Manchester (UK) to study business and economics, which somehow led to an exchange year in Hong Kong. Between taking random classes like \"Jazz, Blues and Broadway\", I traveled all over East and Southeast Asia. That year got me even more interested in the region, so I did a master’s in Chinese economy and business, split between Rotterdam (Netherlands) and Nanjing (China).\n\nDuring those years, I made a living playing online poker. My mum was not thrilled, but it taught me a ton about probability, game theory, decision making, and keeping cool despite setbacks - turns out, all useful in startups.\n\nAfter graduating, I moved to Berlin (Germany), worked briefly for an angel investor, then co-founded Medigo to improve access to quality healthcare globally. We raised a Series A from Accel, built a 50-person team, and helped 200,000+ patients across five continents. Lots of mistakes, lots of pivots, lots of lessons.\n\nI handled almost everything except product and engineering. In 2019, I decided to learn to code - partly out of curiosity, partly out of frustration with not understanding how software is built. A few months in, I was hooked and knew this is what I want to do every day. When the timing was right, I was able to transition out and went all-in on engineering.\n\nIn 2021, I joined ODF, building products for early-stage founders (persona I could relate to well). That’s also where I met Zach!\n\nNow at PostHog, I’m excited to keep helping founders and product engineers build great products!\n\nAfter 18 years abroad, I’m back in Poland, though I travel a fair bit with my wife Ola and our 2-year-old son Jan.\n\nOutside of tech, I tend to obsess over:\n- Board sports (surfing, kiteboarding, wakeboarding, snowboarding)\n- Consuming (and sometimes making) great food and drinks (ramen, tacos, fried chicken, coffee, beer) - lmk if you're up for a taco tour in Tulum 👀",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-03-10",
      "teams": [
        {
          "id": 141,
          "name": "Billing",
          "slug": "billing"
        }
      ],
      "leadTeams": [
        {
          "name": "Billing"
        }
      ]
    },
    {
      "id": 33236,
      "name": "Júlia Esteban Edo",
      "firstName": "Júlia",
      "lastName": "Esteban Edo",
      "role": "Talent Partner",
      "location": "Barcelona",
      "country": "ES",
      "latitude": 41.3825802,
      "longitude": 2.177073,
      "formattedAddress": "Barcelona, Barcelonès, Barcelona, Catalunya, España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1746541779/julia_26d6a0aeb3.png",
      "biography": "I grew up in Barcelona and moved around from a young age, spending quite some time between the UK, Japan and France. \n\nI worked a few student jobs during university and started my career in the world of Recruiting and HR in a tiny startup in Tokyo. I realised early on that I am fascinated by the human experience at work, in particular within the tech industry, where we can find some of the most brilliant minds. \n\nThe time I spent at Palantir has probably shaped me the most, given that I joined when I was only 22, I was full of hunger and continually amazed at everything I learnt from the people around me. I believe that we should all help strengthen our colleagues’ strengths, and the team there did exactly that. They helped me sharpen my emotional intelligence, critical thinking, and the art of interviewing and profiling. I also went on a 6-months rotation in the Storage Infrastructure team for the product Foundry - I loved it! I worked with a bunch of engineers and understood nothing for the first few weeks 😂 but over time I managed to make sense of things and ended up in a *PM-y/staffing sort of role* - they're not big on titles either! \n\nOutside of work stuff, I love my Akita Inu (Aiko), books that make you question things, and... I've lately been obsessed with Lagree 😬\n\nCommon things I hear from my friends: \n* “You’re so fast”\n* “Have a cup of whatever the opposite of coffee is”\n* “I had not thought about it that way”\n* “Stop asking why 😭”\n* “How can you be equally obsessed with raccoons and Chomsky?”\n\n**Random stuff**:\n* I speak English, Catalan, and Spanish fluently, with English being the one I use most often nowadays.\n* I have also spoken French and Italian fluently at some point in my life. I still understand practically 100% of what is spoken/written, but I feel shy about speaking since I haven't practised in a while! 🙈\n* I studied Chinese for 6 years, but I have forgotten everything by now.\n* I can read Hiragana and Katakana without understanding what I'm reading. I can still say/read/understand some stuff, and I'm positive I would pick it back up if I moved back to Japan (or that's what I tell myself lol). It remains one of my favourite languages though! 🌸",
      "color": "lilac",
      "pronouns": "She/Her",
      "pineappleOnPizza": true,
      "startDate": "2025-03-11",
      "teams": [
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33327,
      "name": "Emanuele Capparelli",
      "firstName": "Emanuele",
      "lastName": "Capparelli",
      "role": "Product Engineer",
      "location": "Lisbon",
      "country": "PT",
      "latitude": 38.7077507,
      "longitude": -9.1365919,
      "formattedAddress": "Lisboa, Portugal",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1746632518/em_d845960eb5.png",
      "biography": "Hi, this is Emanuele. Born in Rome, currently living in Lisbon, Portugal, after previous iterations in Germany, USA, Russia, France, Austria, Thailand, and Namibia.\n\nI like collecting degrees: originally a space engineer, I then moved into business management, and recently graduated in philosophy.\n\nI've visited over 200 regions worldwide, and I'm known among friends for various travel mis-adventures — hiking in Kashmir while hallucinating from malaria pills, exploring a warzone in Congo to see endangered gorillas, crashing a car in the middle of the Jordanian desert, among many.\n\nI'm particularly interested in: comic books (primarily DC, Dark Horse, Vertigo), reading Hugo awards books, progressive death metal, and Islamic medieval philosophy. ",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-03-24",
      "teams": [
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33186,
      "name": "Landon DePasquale",
      "firstName": "Landon",
      "lastName": "DePasquale",
      "role": "Product Led Sales Team Lead",
      "location": "Chicago, IL",
      "country": "US",
      "latitude": 41.8755616,
      "longitude": -87.6244212,
      "formattedAddress": "Chicago, South Chicago Township, Cook County, Illinois, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1747938846/landon_9fefb48fc1.png",
      "biography": "I’ve always been fascinated with tech, but as I’ve spent more time with it, what really interests me is how tech can help people flourish.\n\nAfter working a variety of jobs in the software industry from support to communications to strategy, I found my way to the agency world where I spent time working with clients like Mecum Auto Auctions and Timbertech on strategic needs and technical problem solving. I’ve come back to my software roots at PostHog\n\nI live in the western suburbs of Chicago with my wife and five kids.\n\nI drink entirely too much green tea, and enjoy music, reading, and inexpensive watches. I have a soft spot in my heart for cheesy 70s sci-fi covers.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-03-24",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": [
        {
          "name": "Product-Led Sales"
        }
      ]
    },
    {
      "id": 33371,
      "name": "Alex Lebedev",
      "firstName": "Alex",
      "lastName": "Lebedev",
      "role": "Product Engineer",
      "location": " Bielsko-Biała",
      "country": "PL",
      "latitude": 49.822118,
      "longitude": 19.0448936,
      "formattedAddress": "Bielsko-Biała, województwo śląskie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1745851373/alex_l_3e456bd5f4.png",
      "biography": "I got into programming as a kid by reading the \"Hacker\" journal, as my mom used parts of it to wrap a piece of salmon. Tens of years later, as I worked in marketing, I started automating lots of stuff instead of hiring people, and loved it so much that made programming my career.\n\nI love heavy electronic music, highly annoying turn-based strategies, and getting caffeine pills after drinking decaffeinated coffee. Other than that, I'm a pretty sane person (or that's what my wife, a professional therapist, usually says). Also, I love to name my pets after IT terms or anime characters (like one cat, called Vista, or another cat, called Kisame).",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-03-24",
      "teams": [
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33387,
      "name": "Alex McKee",
      "firstName": "Alex",
      "lastName": "McKee",
      "role": "Technical Account Executive",
      "location": "Phoenix, AZ",
      "country": "US",
      "latitude": 33.4484367,
      "longitude": -112.074141,
      "formattedAddress": "Phoenix, Maricopa County, Arizona, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1748531029/alex_m_ac64157d7c.png",
      "biography": "Howdy - I'm Alex. Born in Chicago, raised in Phoenix. \n\nAlthough MatLab was my first introduction to programming (shout-out to my econ majors), I later fell in love with HTML/Tailwind while working as a software designer. Prior to that I was selling developer tools to engineers far and wide while at different start-ups in San Francisco like GitHub & CircleCI.\n\nI loved working with developers so much that I later co-founded a startup where we built a custom DSL that let design engineers build UI supafast. Once I left my startup, I leaned into what I do best, working directly with customers. \n\nI'm based back in Phoenix now, where I live with my wife & 2 amazing daughters. When I'm not online you can likely find me running or at the gym (for leisure, not survival), tinkering in Ableton, or napping with our French Bulldog, Cruz. ",
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-03-31",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33511,
      "name": "Nick Best",
      "firstName": "Nick",
      "lastName": "Best",
      "role": "Product Engineer",
      "location": "British Columbia",
      "country": "CA",
      "latitude": 55.001251,
      "longitude": -125.002441,
      "formattedAddress": "British Columbia, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750683892/nick_b_02cf410e9f.png",
      "biography": "My career began with planting trees in the Cariboo region of British Columbia, Canada. Searching for an out from the long, gruelling days of labour, I started doing a little gold panning on the banks of the [same rivers](https://en.wikipedia.org/wiki/Horsefly_River) that fuelled a gold rush of past. And I read books.\n\nI never found the coveted nugget that would buy my escape from bush camp, but the books that I read while working there (GEB, Vol II of Feynman’s lecture on Physics, a biography of Oliver Heaviside, w/e), sparked an interest in all things electricity and computers. After some formal EE training, I followed this interest south to the modern day gold rush of ZIRP Era Silicon Valley, where people were doing all sorts of things interesting things with electricity and computers. The missions were grand and the capital was cheap, allowing me the opportunity to: work on hardware, build product, and create large scale platform infrastructure all in the span of less than a decade. Most recently, I had the pleasure of [working](https://docs.aws.amazon.com/AWSSimpleQueueService/latest/SQSDeveloperGuide/sqs-fifo-queues.html) on [“the two hard problems in distributed systems”](https://x.com/mathiasverraes/status/632260618599403520)\n\nIt is a coincidence that my favourite author is Franz Kafka.\n\nI currently live in beautiful Squamish, BC with my wife and daughter. They are wonderful, the most precious gifts in my life.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-04-07",
      "teams": [
        {
          "id": 145,
          "name": "Ingestion",
          "slug": "ingestion"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33534,
      "name": "Chris McNeill",
      "firstName": "Chris",
      "lastName": "McNeill",
      "role": "Technical Account Executive",
      "location": "Florida",
      "country": "US",
      "latitude": 27.7567667,
      "longitude": -81.4639835,
      "formattedAddress": "Florida, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1748970836/chris_45304857bb.png",
      "biography": "Hey there! I'm excited to be part of the Sales team at PostHog. My path here wasn't exactly linear – I studied some CS and even wrote code for a living for a bit. However, I quickly discovered that connecting with people was much more fun, which led me into Customer Success and support roles. From there, I moved into sales, where I truly fell in love with the energy of SaaS and early-stage companies like PostHog.\n\nI once shocked myself (literally) when I turned a deceased coffee maker into an alarm clock. I've been doing a great job of taking things apart ever since then, and continue to get better at putting them back together. The coffee maker evolved into letting smoke out of all kinds of computer hardware in the name of \"overclocking\". Then I went pro and started and ran a small IT Service business in college. Currently I have and entirely disassembled car in my shop.\n\nI've lived with at least one dog a whopping 96% of my life, and my wife and I love to rescue them when we can. I like to read, write, fish at the beach, and other somewhat typical things. I was born in Saudi Arabia, and have lived all over the US. Presently I'm in Florida, equidistant from the Atlantic Ocean and the Gulf of Whatsitcalled. ",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-04-07",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33607,
      "name": "Hector Rodriguez",
      "firstName": "Hector",
      "lastName": "Rodriguez",
      "role": "Legal & Compliance",
      "location": "SF Bay Area",
      "country": "US",
      "latitude": 37.6171949,
      "longitude": -122.3810622,
      "formattedAddress": "SF Bay Area Bird Encounters Kids' Spot D7, 780, Departures, San Francisco, San Mateo County, California, 94128, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750683820/hector_b1c520b0b8.png",
      "biography": "Lawyer by trade; started my career at a big corporate law firm representing high growth, venture-backed technology companies in all things legal.  Eventually got bored and decided to make the transition in-house to one of my favorite clients.  Now responsible for general legal, compliance and operations at PostHog.",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-04-14",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33636,
      "name": "Javier Bahamondes",
      "firstName": "Javier",
      "lastName": "Bahamondes",
      "role": "Product Engineer",
      "location": "Chile",
      "country": "CL",
      "latitude": -31.7613365,
      "longitude": -71.3187697,
      "formattedAddress": "Chile",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1748531060/javier_9f06758617.png",
      "biography": "I'm Javier, a Product Engineer at [web-analytics](https://posthog.com/teams/web-analytics) team. I love doing exercise, I did a lot of basketball as child, then gym and lately running, biking and swimming.\n\nI like to build great user experiences.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-04-14",
      "teams": [
        {
          "id": 119,
          "name": "Web Analytics",
          "slug": "web-analytics"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33708,
      "name": "Alex van Leeuwen",
      "firstName": "Alex",
      "lastName": "van Leeuwen",
      "role": "Video Producer",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1752523521/alex_v_d38c66c07d.png",
      "biography": "Having worked for a bunch of different film agencies I’ve found my way to Posthog as video producer - where I’ll be shooting, editing, and coming up with (hopefully) a bunch of cool content ! \n\nWhen I’m not working, I love watching films (unsurprisingly); I’m also big into film photography, travel, and sport - often at the same time. Recent highlights include swimming the Hellespont in Turkey; training Muay Thai in Thailand; and running the 4x4x48 challenge twice back to back. Currently training for the Ljubljana Marathon later in 2025. ",
      "color": "yellow",
      "pronouns": "he/ him",
      "pineappleOnPizza": true,
      "startDate": "2025-04-22",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33750,
      "name": "Sachin Ranchod",
      "firstName": "Sachin",
      "lastName": "Ranchod",
      "role": "Technical Account Manager",
      "location": "CA",
      "country": "US",
      "latitude": 36.7014631,
      "longitude": -118.755997,
      "formattedAddress": "California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750683839/sachin_45f7b488f0.png",
      "biography": "I’m originally from South Africa but now live in Marin, just north of San Francisco, with my wife, two kids, and our dog Lola — who is both emotionally complex and a little confused about how to bark.\n\nBefore moving to the U.S. in 2013, I was a Ruby developer in Cape Town. Since then, I’ve worked at GitHub, Slack (on the Platform team), and Zapier, across a number of technical but non-engineering roles. Somewhere in between, I started a company called Zipper — a platform where you could write and deploy TypeScript functions with autogenerated UIs and APIs.\n\nI’m a generalist at heart and love being involved in every part of building SaaS products — product, engineering, GTM — all of it. I especially enjoy working with developers and helping them do more with less.  I've been lucky to work on tools that developers actually want to use, and I'm excited to continue doing that at PostHog. \n\nOutside of work, you’ll usually find me cooking, watching sports (F1, rugby, NFL, soccer… I don’t discriminate), building side projects (like a co-working space or another random SaaS idea), or chasing my kids around.\n\nLike a lot of people, my journey into tech started with (mostly pirated) video games, shady keygens, and squeezing every ounce of performance out of an aging PC. It’s been a fun ride.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-05-05",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 33938,
      "name": "Edwin Lim",
      "firstName": "Edwin",
      "lastName": "Lim",
      "role": "Technical Content Marketer",
      "location": "Massachusetts",
      "country": "US",
      "latitude": 42.3788774,
      "longitude": -72.032366,
      "formattedAddress": "Massachusetts, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750683857/edwin_36a928c30e.png",
      "biography": "I write and build things at PostHog. \n\nBefore joining the [content team](/teams/content), I worked as a technical writer, software engineer, business architect (still have no idea what that job was about),  political analyst, and research assistant. Along the way, I've learned the most rewarding projects were always the ones I went \"all in\" on.\n\nThe type of guy who's always telling you the type of guy he is:\n- Markdown maximalist\n- Nostalgia junkie\n- Harmless contrarian\n- Firm believer in values over goals\n- Extreme believer that *all* breakfast foods taste better late at night\n\nTalk to me about books, movies, basketball, or whatever you're currently geeking out about. ",
      "color": "lime-green",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2025-05-09",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34037,
      "name": "Kaya Thomas",
      "firstName": "Kaya",
      "lastName": "Thomas",
      "role": "Technical Customer Success Manager",
      "location": "North Carolina",
      "country": "US",
      "latitude": 35.6729639,
      "longitude": -79.0392919,
      "formattedAddress": "North Carolina, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1747938825/kaya_38b8a14a0c.png",
      "biography": "Born and raised in New York, left for college and since then have lived in the Bay Area, Cambridge, Chicago and Boston. After living in big cities for majority of my life, I’ve traded skyscrapers for oak trees and live right outside Raleigh, North Carolina. \n\nI was a STEM kid who always loved problem solving and learning, and when I took my first coding course in college it just clicked for me. I studied computer science and while in undergrad I launched my first iOS app. Post college I spent several years as an iOS engineer at Slack and Calm. \n\nAfter years working as an engineer, I decided to go to grad school to explore paths that would combine my engineering skillset with my other passions. Those passions are mentoring and teaching others which I've done since high school as a tutor, volunteer mentor and public speaker/facilitator. Post grad school, I worked in consulting and solutions engineering which eventually led me to PostHog where I get to help customers make their products more successful with the use of PostHog products. \n\nOutside of work, I spend most of my time with my husband and daughter. When I’m not hanging with family or friends, I’ll usually be reading, writing, volunteering or working on a side project (currently working on another iOS app).",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-12",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34103,
      "name": "José Sequeira",
      "firstName": "José",
      "lastName": "Sequeira",
      "role": "Backend Engineer",
      "location": "Berlin",
      "country": "DE",
      "latitude": 52.5173885,
      "longitude": 13.3951309,
      "formattedAddress": "Berlin, Deutschland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750966827/jose_3617f5d5b4.png",
      "biography": "My career has been mostly around data pipelines, real time event processing, aggregation and search as well as stateful streaming. I love distributed systems and their inherent complexities.\n\nI especially like when \"Good metric go up and bad metric go down\"!, so expect catching me looking at some random dashboard some odd 40 times a day.\n\nOutside of work, I'm a nerd for many things:\n- I love music, proud collector of hundreds of vinyls, I believe I have seen close to a thousand gigs and can play guitar and drums. Show me music in whatever style you like and there's probably some overlap\n- I love tabletop games. I play Magic: The Gathering and recently started DMing a Dungeons & Dragons campaign with friends.\n- I love video games and all things game development",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-12",
      "teams": [
        {
          "id": 145,
          "name": "Ingestion",
          "slug": "ingestion"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34023,
      "name": "Daniel Zaltsman",
      "firstName": "Daniel",
      "lastName": "Zaltsman",
      "role": "Developer who organizes events",
      "location": "Lisbon",
      "country": "PT",
      "latitude": 38.7077507,
      "longitude": -9.1365919,
      "formattedAddress": "Lisboa, Portugal",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1748882025/Daniel_Z_s_Portrait_1_0bdc83df04.png",
      "biography": "It was during the financial crisis of 2008 that I used my remaining year of university - across the Hudson - to immerse myself in the burgeoning New York tech ecosystem. Remember the days of Tumblr, Foursquare, GroupMe and Zynga? Swoon. I went to meetups (NYTech Meetup FTW), worked internships, and took coding classes (remember Avi Flombaum’s Rails course pre-Flatiron School?) It ended up being a formative and direction-defining experience for me, as someone who never had a coherent answer to \"Who do you want to be when you grow up?”\n\nBefore PostHog, I've failed with VYou (short form video startup before TikTok), co-created Hacktoberfest, helped DigitalOcean to IPO (wild ride), worked for Gary Vee (caring character), and travelled to amazing places like Ghana, India, and Portugal for work. So in summary, I’m very lucky. I work with some of the smartest and hardest working people, get to help progress technologies that solve problems for people around the globe, and along the way, I get to connect people to each other in a way that leads to more growth and fun.\n\nTo me, the work we’re doing at PostHog means we’re contributing to making the Internet less lousy (more signals, less noise.) If we can help our users prioritize their customers’ experience in pursuit of better products and services, that means everyone will benefit. \n\nSo far my responsibilities include making events happen and contributing to other marketing efforts: some social and some community management too. If you have a desire to bring PostHog into the realm of IRL, [contact me](mailto:daniel.z@posthog.com) and let’s make Max magic happen. And for more information on how I like to work, check out the README.\n\nAnd some customary \"fun\" facts about me:\n1. **Where are you originally from?** Born in St. Petersburg (was called Leningrad then.) \n2. **What was your oddest job?** Sold hot dogs and hot cocoa at MetLife Stadium (site of World Cup 2026.) \n3. **Any hidden talents?** Ballroom dancing. Not very hidden though since I used to compete. \n4. **Introvert or extrovert?** Ambivert - one whose personality has a balance of the two. \n5. **Favorite desert?** All of them, but especially Tiramisu. Preferably it’s from Lecce in Puglia. ",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-12",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34069,
      "name": "Tyler Crandall",
      "firstName": "Tyler",
      "lastName": "Crandall",
      "role": "Technical Account Manager",
      "location": "United States",
      "country": "US",
      "latitude": 39.7837304,
      "longitude": -100.445882,
      "formattedAddress": "United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750966772/tyler_29092f1af3.png",
      "biography": "I think developers are really neat and software makes the world go round, so I'm happiest when I'm doing things that help make life easier for developers.\n\nMy pathway into tech was probably set when my dad helped me build my first Linux PC from spare parts in the early 2000s and I've been tinkering ever since. \n\nI'm not one for titles, small talk, or bureaucracy, but I love a good sarcastic remark. ",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-19",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34044,
      "name": "Abe Basu",
      "firstName": "Abe",
      "lastName": "Basu",
      "role": "Product Manager",
      "location": "NY",
      "country": "US",
      "latitude": 43.1561681,
      "longitude": -75.8449946,
      "formattedAddress": "New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1754920882/abe_compressed_f9a744d6ba.png",
      "biography": "I grew up in London, but left for the US for university, I wanted to study engineering and finance, and the University of Pennsylvania offered a chance to get degrees in both at the same time so I thought I was getting a great 2-for-1 deal. \n\nFast forward 4 years, I decided to stick around, and made my own [Journey to the West](https://en.wikipedia.org/wiki/Journey_to_the_West) to learn about entrepreneurship by working at startups. After getting some experience at a series B consumer company I struck out on my own with a friend from university (spoiler alert he also works at PostHog). We went through [YCombinator](https://www.ycombinator.com/companies/laudspeaker), and after pivoting for a while found direction working on open source marketing automation with Laudspeaker. We loved what we built, and worked with a few cool large enterprises, but after a surprise acquisition offer in 2025 decided to talk to a few companies we thought we might be more interested in joining. PostHog was top of our list, and acquired us, and now I'm here where I'm working on the messaging product!\n\nApart from working at startups, I love water sports (am currently learning to surf, and [foil](https://www.youtube.com/watch?v=s2azJCYM9rM&ab_channel=JD%E2%80%98FollowCam%E2%80%99) (e or with wing)), enjoy writing (both essays and fiction (am inspired by Michael Crichton / Dan Brown)), read a lot (well mostly audiobooks), meditate, hack on personal projects, and walk as much as possible in NYC!\n\nYou can find me online on [substack](https://substack.com/@abebasu), and soon on a personal website.",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-19",
      "teams": [
        {
          "id": 143,
          "name": "Workflows",
          "slug": "workflows"
        },
        {
          "id": 135,
          "name": "Batch Exports",
          "slug": "batch-exports"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34100,
      "name": "Vincent Ge",
      "firstName": "Vincent",
      "lastName": "Ge",
      "role": "Technical Content Marketer",
      "location": "Toronto",
      "country": "CA",
      "latitude": 43.6534817,
      "longitude": -79.3839347,
      "formattedAddress": "Toronto, Golden Horseshoe, Ontario, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757530197/vincent_86154af018.png",
      "biography": "I studied engineering thinking I loved problem solving. After six internships, I realized what I actually enjoyed was sharing cool solutions with others. It's seeing the light-bulb go on for someone that excites me, not the fancy tech itself. This is how I got into developer relations and advocacy.\n\nI've tried all kinds of DevRel work, but I find teaching-related roles the most rewarding. I want to reduce the head-smashing that comes with adopting new tech, which we've somehow accepted as a rite of passage in tech. \n\nI want to help developers succeed by building confidence through quick wins along a gentle curve, not by tossing them into the deep end and hoping they figure it out. Whether that means filming videos, writing docs, or building demos, I’m all in.\n\nIn my spare time, I run a cooking channel, train dogs, and modify antique tube microphones.",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-19",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34147,
      "name": "Yasen Slavov",
      "firstName": "Yasen",
      "lastName": "Slavov",
      "role": "Product Engineer",
      "location": "Bulgaria",
      "country": "BG",
      "latitude": 42.6073975,
      "longitude": 25.4856617,
      "formattedAddress": "България",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1752523551/yasen_2e6f8184ef.png",
      "biography": "Originally from Eastern Europe, I studied business management in the UK - only to quickly realize that corporate life wasn't for me. I started dabbling in tech, launching side projects like Bulgaria's first co-founder matching platform, and later, a startup combining hardware sensors and SaaS to help beekeepers better care for their hives (I got stung more times than I care to admit during R&D).\n\nFrom there, I ran my own software agency for a few years, building tools and platforms for early-stage startups. Eventually, I swapped the founder life for full-time engineering, working in product analytics at Hotjar before landing at PostHog.\n\nSmall world moment: a year before I joined, I built a side project and used PostHog to spy on my users - had no idea I'd be on the other side of the dashboard 12 months later.\n\nWhen I'm not building things in code, I'm building them in real life - woodworking, leatherwork, 3D printing... I'm also into tennis, volleyball, hiking, and pretty much anything that gets me moving outdoors.",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-05-26",
      "teams": [
        {
          "id": 149,
          "name": "Platform Features",
          "slug": "platform-features"
        }
      ],
      "leadTeams": [
        {
          "name": "Platform Features"
        }
      ]
    },
    {
      "id": 34160,
      "name": "Cory Slater",
      "firstName": "Cory",
      "lastName": "Slater",
      "role": "Product Manager",
      "location": "Seattle, WA",
      "country": "US",
      "latitude": 47.6038321,
      "longitude": -122.330062,
      "formattedAddress": "Seattle, King County, Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750966739/cory_s_compressed_0bafe0a2c4.png",
      "biography": "My career has been wonderfully all over the place, most defined by a desire to work on cool things with cool people. The focus of my work is building products and tools that make sense of massive amounts of data in the face of overwhelming complexity, which I believe is one of the defining challenges of our time.\n\nI studied accounting (cementing my role as “tax man” to friends, family, and business partners) then started my career in consulting. I spent years remixing massive companies (some call it M&A). When they offered to send me to business school, I convinced them to let me build products instead—this spawned an obsession with building useful products. I haven’t looked back since.\n\nFor the last five years, I've been founding companies and chasing ideas that have a healthy amount of “funk.” I've built products and businesses in small business lending, energy market forecasting, and AI systems based on the principles of biological intelligence. Some worked out, others taught me expensive lessons, but each one scratched my itch for turning weird ideas into actual products.\n\nThese days I live in Seattle with my wife and a border collie who's faster and smarter than I am. I grew up on an island, raising pygmy goats and playing in rock bands, which turns out to be excellent preparation for startup life—both involve noise, chaos, and cleaning up the occasional mess.\n\nI have strong opinions about salsa, the Seattle Mariners (decades of heartbreak and counting), and the fact that most data tools are built by people who've never actually had to use them. I code enough to be dangerous but not enough to be cocky about it.\n\nI think autonomy without context is chaos, but context without autonomy is soul-crushing. PostHog seems to have figured out the balance, which is why I'm here.\n",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-05-26",
      "teams": [
        {
          "id": 132,
          "name": "Surveys",
          "slug": "surveys"
        },
        {
          "id": 124,
          "name": "Replay",
          "slug": "replay"
        },
        {
          "id": 130,
          "name": "Error Tracking",
          "slug": "error-tracking"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34146,
      "name": "Andy Zhao",
      "firstName": "Andy",
      "lastName": "Zhao",
      "role": "Backend Engineer",
      "location": "Ontario",
      "country": "CA",
      "latitude": 50.000678,
      "longitude": -86.000977,
      "formattedAddress": "Ontario, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1750683910/andy_z_c4338e0e4b.png",
      "biography": "Hi, I'm Andy! I'm a tennis amateur and a home cook from Toronto, Canada. \n\nWhen I'm not perfecting my serve or charring a steak, I work on the feature flags team. Before PostHog, I was at AWS working on [API Gateway](https://aws.amazon.com/api-gateway/), and before that, I was studying at the University of Waterloo. \n\nAt AWS, I developed an interest in diving deep into foundational systems. I found a lot of enjoyment in making services more resilient and available, all while staying close to the customer to make sure I don't lose sight of their needs.",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-05-26",
      "teams": [
        {
          "id": 152,
          "name": "Analytics Platform",
          "slug": "analytics-platform"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34159,
      "name": "Arthur Moreira de Deus",
      "firstName": "Arthur",
      "lastName": "Moreira de Deus",
      "role": "Product Engineer",
      "location": "Brazil",
      "country": "BR",
      "latitude": -10.3333333,
      "longitude": -53.2,
      "formattedAddress": "Brasil",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1755193390/arthur_2a4443c5f6.png",
      "biography": "Born and raised in Florianópolis, Brazil, majored in electrical engineering but got into software mid-college and never looked back.\n\nI can do a lot of things, but I'm not great at any. I love sports, so I've tried cycling, running, karting, football (as a goalkeeper), jiu jitsu and rowing.\n\nI also love music, so I've taught myself how to play the guitar and the drums. \n\nLately, when I'm not watching copious amounts of TV shows with my wife, I'm likely working out/running with her. ~Our goal is to run a half marathon this year.~ We ran a half marathon this year and I'm going for the second one in November!\n\nI love trying out new restaurants and traveling. Even better when doing both together.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-06-23",
      "teams": [
        {
          "id": 142,
          "name": "Customer Analytics",
          "slug": "customer-analytics"
        }
      ],
      "leadTeams": [
        {
          "name": "Customer Analytics"
        }
      ]
    },
    {
      "id": 34497,
      "name": "Janani K",
      "firstName": "Janani",
      "lastName": "K",
      "role": "Finance Manager",
      "location": "Canada",
      "country": "CA",
      "latitude": 61.0666922,
      "longitude": -107.991707,
      "formattedAddress": "Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1754935394/janani_0a0794aef5.png",
      "biography": "the finance cat lady is in the house!\n\ni've been in accounting and finance for a few years now, it is a love-hate relationship. i like making sense of numbers, bringing order to the chaos and a balanced set of books bring me great joy. i love accounting so much that i may sometimes bore you with an unnecessary (but very fun!) explanation on some accounting concepts (free accounting 101 lessons, anyone?)\n\ni may come across as grumpy on Slack - i probably haven't had the 17th cup of bad coffee that day. i'm also just behind on the emoji game, and my attempts at humour mostly fall flat!\n\ni enjoy reading, hiking and being a couch potato outside work.",
      "color": "seagreen",
      "pronouns": "she/her/elle",
      "pineappleOnPizza": true,
      "startDate": "2025-06-23",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34526,
      "name": "Tara Alcantarilla-Howard",
      "firstName": "Tara",
      "lastName": "Alcantarilla-Howard",
      "role": "Operations Manager",
      "location": "Hertfordshire",
      "country": "GB",
      "latitude": 51.8400523,
      "longitude": -0.0978552,
      "formattedAddress": "Hertfordshire, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1752999554/tara_4791f3416a.png",
      "biography": "I've been working in tech startups for the last 8 years, always within an Ops/Project capacity. So as Ops Manager, you'll find me doing a bit of everything. Usually putting out fires before people smell burning, or tinkering away in the background making sure things run smoothly for the team. \n\nI actually trained as an actor and worked professionally for 6 years before realising that I liked having money to travel and buy things (Jokes aside, I do really miss it) No, you wouldn't have seen me in anything - unless you have a thing for niche adverts. \n\nI live in Hertfordshire with my wife and two children. So in my spare time (who am I kidding, I have no spare time) you'll find me hunting down new coffee or cake spots. I have a terrible sweet tooth! \n\nMy toxic trait is that I leave cupboard drawers and doors open EVERYWHERE. \"I see dead people\" Name that movie!\n",
      "color": "salmon",
      "pronouns": "she/her",
      "pineappleOnPizza": true,
      "startDate": "2025-06-25",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34600,
      "name": "Alessandro Pogliaghi",
      "firstName": "Alessandro",
      "lastName": "Pogliaghi",
      "role": "Product Engineer",
      "location": "Dublin",
      "country": "IE",
      "latitude": 53.3493795,
      "longitude": -6.2605593,
      "formattedAddress": "Dublin, County Dublin, Leinster, Éire / Ireland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1752758145/Alessandro_8cb6e46482.png",
      "biography": "Born and raised in Italy 🇮🇹, studied CS in Milan and then went to Switzerland for studying even more, 'cause why not? \nWorked at a couple of payments-based companies, first in Berlin and then in Dublin.\n\nI live in Dublin with my partner and our two dogs Mimi' and Millie. \nWe love to cook and try new foods and movies.\nIf you have any food or tv/movie recs, just shoot them my way!\n\nNow I am here, chugging along. Trying to figure out stuff and breaking stuff 👨‍💻",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-06-30",
      "teams": [
        {
          "id": 134,
          "name": "PostHog AI",
          "slug": "posthog-ai"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34571,
      "name": "Jonathan Mieloo",
      "firstName": "Jonathan",
      "lastName": "Mieloo",
      "role": "Software Engineer",
      "location": "Amsterdam",
      "country": "NL",
      "latitude": 52.3730796,
      "longitude": 4.8924534,
      "formattedAddress": "Amsterdam, Noord-Holland, Nederland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1752523493/jonathan_dd72f696d7.png",
      "biography": "Enthusiastic about building products that spark joy.\nI previously worked at a digital agency and a B2C startup. I then decided to help out PostHog since they're offering a SaaS product that does not give me a headache every time I use it!",
      "color": "yellow",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2025-07-01",
      "teams": [
        {
          "id": 158,
          "name": "Array",
          "slug": "array"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34651,
      "name": "Tom Piccirello",
      "firstName": "Tom",
      "lastName": "Piccirello",
      "role": "Security stuff",
      "location": "CA",
      "country": "US",
      "latitude": 36.7014631,
      "longitude": -118.755997,
      "formattedAddress": "California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756223415/Tom_P_s_Portrait_1_e608ef45e5.png",
      "biography": "I primarily focus on █████████████████████.",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-07",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34655,
      "name": "Jon Lu",
      "firstName": "Jon",
      "lastName": "Lu",
      "role": "Technical Account Manager",
      "location": "NYC",
      "country": "US",
      "latitude": 40.7127281,
      "longitude": -74.0060152,
      "formattedAddress": "City of New York, New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756766308/jon_l_1_16d24f404d.png",
      "biography": "Hey there, my name’s Jon. My family is originally from Taiwan but I'm very much a New Yorker, having lived in NYC for over 2 decades. \n\nI've worn many hats in my career but it all started in **data and analytics** at Accenture, where I helped several Fortune 500 companies implement business intelligence and analytics products. I then dipped my toes into the startup ecosystem at JW Player, where I built their customer-facing data product and pivoted to run **RevOps** to help the company through a couple of acquisitions and 2x their ARR. \n\nMost recently, I co-founded [Baober](http://baober.co), an online platform where new parents can find and book experienced caregivers for their newborn baby. This was my first time being a full-stack developer and when I fell in love with PostHog’s product.\n\nJoining PostHog brings me back to my roots in analytics, and closer to what I enjoy doing now \\- helping other companies succeed by getting the most out of their (customer) data.\n\nOutside of the office, you can usually find me 3D Printing something cool or useful, lifting weights and practicing mixed martial arts in the gym, or playing games on my PC and Steam Deck (currently obsessed with Monster Hunter Wilds, Baulder’s Gate 3, and R.E.P.O.). I also volunteer as a Program Lead at [Startup Leadership Program](https://www.slp-nyc.com/), where I help other founders accelerate their entrepreneurial journey through a 6-month, no-equity fellowship.  ",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-07-07",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34696,
      "name": "Kyle Swank",
      "firstName": "Kyle",
      "lastName": "Swank",
      "role": "Technical Support Engineer",
      "location": "Michigan",
      "country": "US",
      "latitude": 43.6211955,
      "longitude": -84.6824346,
      "formattedAddress": "Michigan, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757007819/Kyle_s_Portrait_1_745aa20835.png",
      "biography": "I always loved LEGO as a kid. Building things specifically, using my imagination to build something new. My interests evolved, my fascination with computers increased and I started building computers with LEGO. Then I started building on the family computer. \n\nI started my career in technical support and troubleshooting at a very early age and got more reps each time I managed to break the family computer. Fixing it before anyone noticed was always the tricky part. This extended to automotive interests and having to troubleshoot car problems as I became interested in muscle cars. \n\nI love to build things, whether it be LEGO, cars, or software.\n\nOutside of work I try to stay active with running and rowing. I've picked up a camera again after more than a decade away and enjoy capturing my journey. Playing guitar and learning music theory teaches me patience and persistence. Reading lets me escape by reading fantasy and learn by reading biographies and other non-fiction. If I ever don't show up to work it's probably because the stack of books fell over on top of me. Send help.\n\n",
      "color": "red",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-07-07",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34722,
      "name": "Daniel Danilov",
      "firstName": "Daniel",
      "lastName": "Danilov",
      "role": "Onboarding Specialist",
      "location": "Israel",
      "country": "IL",
      "latitude": 30.8124247,
      "longitude": 34.8594762,
      "formattedAddress": "ישראל",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756150325/daniel_d_32ac2b94a9.png",
      "biography": "Based in Israel and occasionally working out of Karlovy Vary, I’ve spent the last decade working remotely at the intersection of support, web building, and product. \n\nAlong the way, I led teams, picked up product analytics and data skills, and developed a deep appreciation for tools that help people build better things.\n\nThat’s what drew me to PostHog: a culture that’s fast, technical, and product-focused, with a product I genuinely believe in.\n\nOutside of work, I’m usually parenting my daughter, hanging with my chihuahua, or spending weekends with my partner. I try to squeeze in burpees for physical health, writing for mental health, and some DotA 2 or Switch games when I need to unwind.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-07-14",
      "teams": [
        {
          "id": 150,
          "name": "Onboarding",
          "slug": "onboarding"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34711,
      "name": "Radu Raicea",
      "firstName": "Radu",
      "lastName": "Raicea",
      "role": "Product Engineer",
      "location": "Montréal, Québec",
      "country": "CA",
      "latitude": 45.5031824,
      "longitude": -73.5698065,
      "formattedAddress": "Montréal, Agglomération de Montréal, Montréal (région administrative), Québec, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1754935581/radu_ed4fb41016.png",
      "biography": "Hi everyone! I’m Radu, a product engineer at PostHog.\n\nIn the past, I’ve written simulations that ran on supercomputers, built AI voice assistants for non-technical users, worked on massive checkout systems, and more.\n\nI live in Montréal, Québec, where I spend a lot of my free time on a lake (or driving to one), usually kayaking.\n\nI grew up in Montréal but was born in Romania. I speak French, English, and Romanian natively, plus conversational Spanish.",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-18",
      "teams": [
        {
          "id": 139,
          "name": "LLM Analytics",
          "slug": "llm-analytics"
        }
      ],
      "leadTeams": [
        {
          "name": "LLM Analytics"
        }
      ]
    },
    {
      "id": 34783,
      "name": "Alex Lider",
      "firstName": "Alex",
      "lastName": "Lider",
      "role": "Product Engineer",
      "location": "Barcelona",
      "country": "ES",
      "latitude": 41.3825802,
      "longitude": 2.177073,
      "formattedAddress": "Barcelona, Barcelonès, Barcelona, Catalunya, España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1754934668/alex_lider_dd6647f277.png",
      "biography": "Before joining PostHog, I was the founder of Clientpulse.ai (an analytics tool for clustering user feedback). \n\nSomewhere along the way, I realized I enjoy building and shipping things myself more than anything, so I made the switch to being a product engineer.\n\nI started programming in high school, making 2D games in C and building robots for FTC competitions (somehow, we even won rounds in Australia and China).\n\nI have a software engineering degree and worked as a product manager before diving into startups. \n\nMost of my experience was with B2C products, where analytics was essential. I ended up being pretty good at product and marketing analytics. Doing most of it myself helped me come up with better hypotheses, prioritize them, and iterate faster. That's when I first fell in love with PostHog! \n\nOutside of work, I live in Barcelona, lift heavy stuff in the gym, and spend weekends hiking in the mountains with my dog. ",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-21",
      "teams": [
        {
          "id": 149,
          "name": "Platform Features",
          "slug": "platform-features"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34665,
      "name": "Andrew Pelly",
      "firstName": "Andrew",
      "lastName": "Pelly",
      "role": "Technical Account Manager",
      "location": "Bristol, UK",
      "country": "GB",
      "latitude": 51.4538022,
      "longitude": -2.5972985,
      "formattedAddress": "Bristol, City of Bristol, West of England, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1761077396/andrew_p_b0544ee65a.png",
      "biography": "My first piece of code was a macro written in Lua to get my pet to attack automatically after casting Hunter's Mark. If you know, you know. \n\nWhen I'm not Posthogging I'm building scripts to automate very easy tasks, taking on massive DIY projects and drowning in them, or planning my next week of living in a tent in the mountains.\n\nI grew up in Switzerland, so can posthog in Italian, French or Spanish. ",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-07-21",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34641,
      "name": "Christian Rafferty",
      "firstName": "Christian",
      "lastName": "Rafferty",
      "role": "Technical Support Engineer",
      "location": "Belfast",
      "country": "GB",
      "latitude": 54.5975805,
      "longitude": -5.9277097,
      "formattedAddress": "Belfast, Belfast City District, County Antrim, Northern Ireland / Tuaisceart Éireann, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1754934819/christian_1b37b943af.png",
      "biography": "Hey! I'm Christian. \n\nI grew up in the smallest county in the Republic of Ireland, where I finished a degree in Game Development and Computer Science, which I am still quite passionate about and more than happy to chat about - even if I do get less time to play them these days. \n\nAfter a short stint in a QA position I moved to Bath, UK and worked as a Product Support engineer for close to three years. I've since moved back to Ireland and I'm currently residing in Belfast, Northern Ireland.\n\nIn my free time I try to balance a variety of hobbies; Music projects, going to gigs, gaming, hiking, MTG, Small dev projects and more recently I've been learning to play the Mandolin. There are so many things to do in life that it's difficult to nail down one definitive hobby, and I'm always happy to throw myself at a new one! \n\nI've spent the majority of my career at this point as a Technical Support Engineer and love it. I like to think it gives me the opportunity to learn so much about many different things from people much smarter than I am. \n\nI'm fairly easy-going, so feel free to reach out and chat or ask questions if anything is unclear! \n\n",
      "color": "lilac",
      "pronouns": "He/Him",
      "pineappleOnPizza": true,
      "startDate": "2025-07-21",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34692,
      "name": "Rune Povlsen",
      "firstName": "Rune",
      "lastName": "Povlsen",
      "role": "Talent Partner",
      "location": "Portugal",
      "country": "PT",
      "latitude": 39.6621648,
      "longitude": -8.1353519,
      "formattedAddress": "Portugal",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756835227/rune_1_1ccf809d94.png",
      "biography": "Originally from Denmark, but I've spent the last 10+ years living abroad. I've lived in 3 different countries, but mostly in Portugal, and for the last 5 years in the beautiful Algarve region ☀️🌴  I should speak better Portuguese than I do. Most people blame my better half for not teaching me better, and I tend to agree with them. She should definitely have taught me better at this point.\n\n8+ years in recruitment doing a number of roles in both tech and commercial area. I love working in growing startups and being part of building things from scratch. If we are not building something new it will get boring fast.\n\nBefore PostHog I've worked in adtech, fintech and proptech - I love to learn new things, so obviously I had to join PostHog and learn everything there is to learn here.\n\nIn 2024 I picked up one of my old hobbies again: reading. I ended up reading 40+ books that year. I still read quite a lot, and especially sci-fi and adventure books. Message me if you have any good recommendations (for inspiration: I'm a big fan of anything from Asimov, and Herbert's Dune).\n\nI used to do a lot of sport (gymnastics, athletics/ track and field, badminton, archery, etc.), but getting old kinda sucks, so now I spend more time being a homebody enjoying my own space. If you can call running a sport? I used to be somewhat good at sports, but mainly the ones that no one else really cares about.\n\nNot an extrovert. I like to observe, listen and analyze.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-21",
      "teams": [
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34861,
      "name": "Tue Haulund",
      "firstName": "Tue",
      "lastName": "Haulund",
      "role": "Software Engineer",
      "location": "Denmark",
      "country": "DK",
      "latitude": 55.670249,
      "longitude": 10.3333283,
      "formattedAddress": "Danmark",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1755005633/Tue_s_Portrait_1_1_18d78e030e.png",
      "biography": "Born and raised in Copenhagen, Denmark, where I now live with my girlfriend and our daughter. Started coding up video games in Visual Basic at age 12, studied CS at university and have since been a professional developer at companies of all shapes and sizes.\n\nI really love cycling, both for exercise, leisure and just to get around. I have more bicycles than I could ever need and the only reason I don't have even more bicycles is because I cannot afford a place big enough to store them all.\n\nOther things I really like: Urbanism, architecture, weightlifting, Slovenia and the blues.",
      "color": "orange",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-28",
      "teams": [
        {
          "id": 124,
          "name": "Replay",
          "slug": "replay"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34804,
      "name": "Jordo Dibb",
      "firstName": "Jordo",
      "lastName": "Dibb",
      "role": "Video Post-Production Specialist",
      "location": "Nashville",
      "country": "US",
      "latitude": 36.1622767,
      "longitude": -86.7742984,
      "formattedAddress": "Nashville, Davidson County, Middle Tennessee, Tennessee, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1755541368/jordo2_d8e4070d35.png",
      "biography": "**name:** Jordo Dibb  \n**role:** Video Post-Production Specialist  \n**location:** One cave down from Gollum's  \n**hair color:** Walter White  \n**current status:** Likely waiting for something to export\n\n**spikes:**  \n- Editing speed: 92  \n- Pokémon collection: 151  \n- Caffeine regen: +4/s  \n- Daily donut limit: 429 (Too Many Requests)  \n\n**known issues:**  \n- Will rename files 6 times before choosing one  \n- Requires deadline pressure to perform adequately  \n- Is overly sappy",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-28",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34810,
      "name": "Daniel Hawkins",
      "firstName": "Daniel",
      "lastName": "Hawkins",
      "role": "Production Designer",
      "location": "Portland, OR",
      "country": "US",
      "latitude": 45.5202471,
      "longitude": -122.674194,
      "formattedAddress": "Portland, Multnomah County, Oregon, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756150434/daniel_h_c982f229a8.png",
      "biography": "I’ve called the Pacific Northwest home for several years now, but I spent a good stretch of time in both Colorado and Kansas City before landing in Portland. The combo of mountains and ocean nearby makes this a pretty ideal place to be.\n\nOn the weekends, you’ll probably find me at a food truck pod—ideally one I haven’t been to yet. I’d rather try something totally new (even if it’s a miss) than eat the same thing over and over, and thankfully, that’s pretty easy here.\nWe’ve been slowly remodeling our 100-year-old house—which is equal parts charm and money pit—and recently added a vintage tin-can trailer to our camping setup. That’s kicked off more camping trips and weekend getaways, which has been fun.\n\nI’m into simple woodworking and carving, casual hikes, and riding my bike. If you want to talk movies, sourdough, dogs (I’ve got a big one and a little one), or just about anything else, I’m all ears.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-07-28",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34997,
      "name": "Mark Deubel",
      "firstName": "Mark",
      "lastName": "Deubel",
      "role": "Tech Talent Partner",
      "location": "The Netherlands",
      "country": "NL",
      "latitude": 52.2434979,
      "longitude": 5.6343227,
      "formattedAddress": "Nederland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1758817906/Mark_D_s_Portrait_1_ce67770006.png",
      "biography": "I’ve spent two decades dancing across technology fields from electrical, mechanical, satellite, all the way to IT. And not just in offices! I apparently had to try ships and even helicopters in the Royal Dutch Navy and the Airforce. \nBasically, if it moves, hums, or beeps, I’ve probably had my hands in it.\n\nThen, in 2016, something strange happened. By a twist of fate (or a recruitment vortex?) I was pulled into Talent Acquisition. I still don’t fully understand how it happened, but I suspect I just liked building teams more than I liked building machines. Or maybe a head injury... who knows!\n \nOnce I got my hands on startup hiring I was hooked for life.\nSince then, I’ve helped three startups scale. Two of which I rode all the way to IPO as part of their core teams. At Elastic, I joined when we were just a few hundred people and helped scale the team to over 3,500 remote employees. At GitLab, I rolled up my sleeves to help build out processes and scale them to the next level.  And at Synthesia? I dove into the deep end with their R&D team, hiring AI researchers and reading so many academic papers I’m pretty sure I temporarily went cross-eyed.\n\nAlong the way, I discovered I love talking about this stuff. I host a podcast, speak at TA events, and in 2023 I was able to check off a massive personal bucket-list goal: being on stage at RecFest, the largest TA event out there.(still proud). I LOVE employer branding, so you'll see me everywhere!\n\nOutside of work, I’m still building. Only now it’s the kitchen, bathroom, custom furniture, etc. Most of our house is handcrafted by me. (and still under construction).\nI’ve also got more books than I can read and a cello that I'm attempting to play after years of playing guitar. My daughter is either deeply inspired or slowly losing her mind from all the squeaky notes. It’s a toss-up.\n\nSo yeah, I’m a builder through and through; whether it’s teams, products, or IKEA alternatives with fewer screws and more swearing.\n",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-08-05",
      "teams": [
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35076,
      "name": "Carol Donnelly",
      "firstName": "Carol",
      "lastName": "Donnelly",
      "role": "Operations Manager",
      "location": "Oklahoma City, OK ",
      "country": "US",
      "latitude": 35.4729886,
      "longitude": -97.5170536,
      "formattedAddress": "Oklahoma City, Oklahoma County, Oklahoma, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757530230/carol_84e73b53a8.png",
      "biography": "I've spent the last 15 years in various People and Ops roles, getting to experience all kinds of environments, but high growth startups are where I feel most at home. I like creating new processes or untangling old ones and breathing new life into them. You'll find my hand in a little bit of everything, depending on the day. Mostly, just another hog in the burrow trying to make work life less \"oh no\" and more \"ohhh nice\".\n\nOutside work, I'm a mom of two kiddos who keep me laughing, humble and slightly off-balance in the best way. They roast me like its their job, make me cry from laughing, and make it impossible not to slow down and enjoy the moment!\n\nI'm a walking contradiction: great coordination in sports, yet capable of tripping over air. 0/10 spatial awareness in doorways. I don't like chocolate, peanut butter, or wearing shoes (my closet shelves would suggest otherwise...). \n\nAnd yes, the whispers are true: I'm not a fan of pizza. I know. I live dangerously. I'm open to conversion, but dessert pizza feels like a loophole and I'm clinging to it. We'll let Max and the pizza council decide. ",
      "color": "teal",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-08-11",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35044,
      "name": "Ryan McCrary",
      "firstName": "Ryan",
      "lastName": "McCrary",
      "role": "Technical Account Manager",
      "location": "South Carolina",
      "country": "US",
      "latitude": 33.6874388,
      "longitude": -80.4363743,
      "formattedAddress": "South Carolina, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1758319925/Ryan_M_s_Portrait_1_1d26281ec5.png",
      "biography": "After spending nearly a decade running a non-profit, I decided that I wanted to be a software engineer when I grew up. I spent a few years building software for a fintech company before getting pulled into a vague “customer engineer” role at a startup called RudderStack. During my time there I bounced between support/CS, product and sales engineering. \n\nThat made me realize that I not only liked building technical solutions, but liked helping other teams be successful with technical solutions, namely building their data warehouse and managing customer data. So here I am, helping technical teams solve problems with their customer data.\n\nOutside of PostHog, I run a [cafe/bar](https://mountaingoatgvl.com) with my wife and chase my two little humans (hey Mae and Bert!) around. I also run. I try to run at least 36 miles a week (or ~60km, or 325,851 hedgehogs)",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-08-18",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35123,
      "name": "Ben Smith",
      "firstName": "Ben",
      "lastName": "Smith",
      "role": "Technical Customer Success Manager",
      "location": "Austria",
      "country": "AT",
      "latitude": 47.59397,
      "longitude": 14.12456,
      "formattedAddress": "Österreich",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759960450/ben_s_13d0661690.png",
      "biography": "Originally from the UK, I now live in Vienna, which manages to be voted simultaneously the best city in the world _and_ the most unfriendly. I do my bit by never littering, usually paying my taxes and always skipping queues. ",
      "color": "green",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2025-08-18",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35074,
      "name": "Eleftheria Trivyzaki",
      "firstName": "Eleftheria",
      "lastName": "Trivyzaki",
      "role": "Billing Support Specialist",
      "location": "Athens",
      "country": "GR",
      "latitude": 37.9755648,
      "longitude": 23.7348324,
      "formattedAddress": "Αθήνα, Δήμος Αθηναίων, Περιφερειακή Ενότητα Κεντρικού Τομέα Αθηνών, Περιφέρεια Αττικής, Αποκεντρωμένη Διοίκηση Αττικής, 105 57, Ελλάς",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759960422/eleftheria_b1767fa4a2.png",
      "biography": "Born and raised in Crete, the largest (and best) of the Greek islands (though, I might be a bit biased). I originally studied communication and media, somehow ended up with a master's in computer science, and soon after got into tech.\n\nI’ve spent the majority of my career in just about every support role there is (product, technical, billing), but right now, I'm all about making sure the billing side of things runs smoothly.\n\nWhen I’m not working, you’ll find me watching sports, playing music, or on the hunt for the best food spots in Athens (really tough job, but someone’s got to do it). ",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-08-18",
      "teams": [
        {
          "id": 128,
          "name": "Support",
          "slug": "support"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 34860,
      "name": "Carlos Marchal",
      "firstName": "Carlos",
      "lastName": "Marchal",
      "role": "Product Engineer",
      "location": "Barcelona",
      "country": "ES",
      "latitude": 41.3825802,
      "longitude": 2.177073,
      "formattedAddress": "Barcelona, Barcelonès, Barcelona, Catalunya, España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760013421/carlos_ebc39869ce.png",
      "biography": "I’ve been fascinated by technology for as long as I can remember. When I was eight, I even took apart my parents' TV just to see how it worked (they were NOT happy).\n\nAfter uni, I picked up all sorts of freelance jobs, ranging from setting up cloud infrastructure to running ethernet cables through walls. That period of exploration is where I discovered my real passion: building products.\n\nTo chase that passion, I co-founded Haddock (YC W22). It was an amazing journey that taught me to wear many hats. In the end, though, I realised two things: I wasn’t in love with our problem space, and I wanted to shift my focus from the super-generalist founder role to growing as an engineer.\n\nAfter that, I joined HappyScribe, working alongside some of the most talented people I’ve ever met. That experience also confirmed my love for startups and the building process, which eventually led me to PostHog, where supporting others on similar journeys is at the heart of what we do.\n\nOutside of work, you’ll usually find me in the kitchen experimenting with recipes, playing video games with friends, or nerding out over obscure history facts.",
      "color": "yellow",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2025-08-25",
      "teams": [
        {
          "id": 139,
          "name": "LLM Analytics",
          "slug": "llm-analytics"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35094,
      "name": "Jovan Sakovic",
      "firstName": "Jovan",
      "lastName": "Sakovic",
      "role": "Clickhouse Engineer",
      "location": "London",
      "country": "GB",
      "latitude": 51.5074456,
      "longitude": -0.1277653,
      "formattedAddress": "London, Greater London, England, United Kingdom",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759960393/jovan_cfa9761db8.png",
      "biography": null,
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-09-01",
      "teams": [
        {
          "id": 129,
          "name": "ClickHouse",
          "slug": "clickhouse"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35171,
      "name": "Georgis Andonis",
      "firstName": "Georgis",
      "lastName": "Andonis",
      "role": "Product Engineer",
      "location": "Sofia",
      "country": "BG",
      "latitude": 42.6977028,
      "longitude": 23.3217359,
      "formattedAddress": "София, Средец, Столична, София-град, България",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760732884/georgis_67f4dfae57.png",
      "biography": "Half Bulgarian and half Greek, I was born and raised in Bulgaria.\n\nMy journey in tech started back in high school, where I loved to creating visuals of any kind. Naturally, I began working as a graphic and web designer. Then curiosity drove me to explore how the static designs become live applications through code. That passion led me to pursue a Software Engineering degree, where I dove deeper into building SaaS products end-to-end.\n\nOver the past 10+ years, I've been building SaaS products in the devtools and product analytics space. Also, built and scaled a product analytics company from scratch, which was successfully acquired.\n\nOutside of work, I'm passionate about sports and cars (especially Formula 1), enjoy quality time with my family and friends, and love swimming in the turquoise waters of Greece.",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-01",
      "teams": [
        {
          "id": 118,
          "name": "Product Analytics",
          "slug": "product-analytics"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35198,
      "name": "Aleksander Błaszkiewicz",
      "firstName": "Aleksander",
      "lastName": "Błaszkiewicz",
      "role": "Product Engineer",
      "location": "Gdańsk, Poland",
      "country": "PL",
      "latitude": 54.3482907,
      "longitude": 18.6540233,
      "formattedAddress": "Gdańsk, województwo pomorskie, Polska",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1758577382/aleksander_b_ee7c4cc48a.png",
      "biography": "My first experience with programming came when I was 12, after my mmm signed me up for summer Lego Mindstorms classes. That quickly spiraled into Arduino, and before long, some drawers and cabinets in our house opened at the press of a button. My parents had… mixed feelings. Eventually, I realised that pure software (without hardware) was a safer way forward.\n\nAt 18, I moved to Gdańsk to get my Computer Science degree. I’ve been there ever since, mostly coding, tinkering, and building side projects I may or may not finish (but I definitely register domains for).\n\nI’m slightly obsessive about cleanliness — especially when it comes to my hands, phone, keyboard, mouse, and car.\n\nFood-wise, I found choosing what to eat every day to be a monumental waste of brainpower. So I started eating burritos. Every weekday. Two a day. I batch-cook about 60 of them once a month and freeze them — and I’ve been doing that for the past year and a half. Time really does fly…\n\nI’m a dog lover, a Rubik’s cube solver, and generally obsessed with technology — the sort of person who is always just trying something out on the side.",
      "color": "purple",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-01",
      "teams": [
        {
          "id": 130,
          "name": "Error Tracking",
          "slug": "error-tracking"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35043,
      "name": "Dustin Byrne",
      "firstName": "Dustin",
      "lastName": "Byrne",
      "role": "Product Engineer",
      "location": "Massachusetts",
      "country": "US",
      "latitude": 42.3788774,
      "longitude": -72.032366,
      "formattedAddress": "Massachusetts, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1758057343/dustin_0fe508a2d4.png",
      "biography": "I discovered programming when I was about nine years old, stumbling upon the modding scene for Unreal without really knowing what I was getting into. I was immediately hooked. That curiosity eventually launched my career, beginning in game development where I shipped a range of titles across education, business, and research.\n\nLater, I transitioned into traditional software through pre-sales engineering and discovered how much I enjoy working closely with customers. I love listening to their challenges, understanding their environments, and designing solutions that truly meet their needs. That experience cemented what I value most: building from the ground up, collaborating with users, and creating experiences that people genuinely appreciate. This passion for creating solutions from scratch naturally led me to the startup world, where I've co-founded a company, built and shipped developer tools with millions of downloads, and earned several patents along the way.\n\nI live in Massachusetts with my wife and two daughters. In my free time, I enjoy tinkering with side projects in game development, flying FPV drones (and, just as often, repairing them), and cooking. I love trying new techniques, perfecting recipes, and pushing myself to learn new things in (and out of!) the kitchen.",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-09-01",
      "teams": [
        {
          "id": 115,
          "name": "Feature Flags",
          "slug": "feature-flags"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35037,
      "name": "Christophe Eynius Tranberg",
      "firstName": "Christophe",
      "lastName": "Eynius Tranberg",
      "role": "Technical Customer Success Manager",
      "location": "Copenhagen",
      "country": "DK",
      "latitude": 55.6867243,
      "longitude": 12.5700724,
      "formattedAddress": "København, Københavns Kommune, Region Hovedstaden, 1357, Danmark",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759265327/christophe_e19b81c214.png",
      "biography": "My first failure in tech was in 2010 when I accidentally sent a marketing newsletter with images in relative URLs. The next day, I decided to start selling \"newsletter marketing\". It ended up paying my rent for a couple of years.\n\nSince then, my biggest accomplishments are building a weather forecast integration with Salesforce to generate weather-indexed quotes, making my light bulb change color when someone rings at the door, and connecting data sources together to make smarter business decisions. \n\nI'm passionate about building all sort of things, in the virtual and the physical world and love challenges to learn new skills.\n\nMy hobbies include (and are not limited to) cycling, running, cooking, pretending to know something about wine. Be warned, I can get awfully nerdy about all of those.\n\nBorn and raised in France, I've called Copenhagen my home since 2015 and living here with my wife, our daughter and our 2 cats.",
      "color": "sky-blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-01",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35215,
      "name": "James Komara",
      "firstName": "James",
      "lastName": "Komara",
      "role": "Technical Sales",
      "location": "WA",
      "country": "US",
      "latitude": 47.2868352,
      "longitude": -120.212613,
      "formattedAddress": "Washington, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760383801/James_K_fad0012809.png",
      "biography": "Hello world! My tech journey started in a typical debate of Mac vs PC (and vs Linux), plus being fascinated by many connected paths of IT, Business, and Computer Science. \n\nThis led me to a career building teams and systems at the intersection of business and technical with curiosity to explore all areas of company growth.\n\nWhen I'm not working, I could still be at the keyboard, or in one of many activities to get moving. \n\nRandom quotes and contemplation:\n- [Wirth's law](https://en.wikipedia.org/wiki/Wirth's_law): Software gets slower faster than hardware gets faster.\n- [Conway's law](https://en.wikipedia.org/wiki/Conway's_law): Organizations which design systems are constrained to produce designs which are copies of the communication structures of these organizations. \n- Gates: \"The first rule of any technology used in a business is that automation applied to an efficient operation will magnify the efficiency. The second is that **automation applied to an inefficient operation will magnify the inefficiency.\"**\n- Jobs: https://putsomethingback.stevejobsarchive.com/\n- Howe: \"There's always something in the game you wish you would have done different. That's why players improve, because they learn form what they did before.  They might have been guessing before, but now they know.\"\n- \"It's so hard to forget pain, but it's even harder to remember sweetness. We have no scar to show for happiness. We learn so little from peace\" - Palahniuk",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-09-02",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35298,
      "name": "Gustavo Henrique Strassburger",
      "firstName": "Gustavo Henrique",
      "lastName": "Strassburger",
      "role": "Product Engineer",
      "location": "NOVO HAMBURGO",
      "country": "BR",
      "latitude": -29.6905705,
      "longitude": -51.1429035,
      "formattedAddress": "Novo Hamburgo, Região Geográfica Imediata de Novo Hamburgo - São Leopoldo, Região Metropolitana de Porto Alegre, Região Geográfica Intermediária de Porto Alegre, Rio Grande do Sul, Região Sul, Brasil",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757353733/1756239270053_c616aff168.png",
      "biography": "I’ve been on quite the coding journey, starting with Flash (remember that?), PHP, MySQL, and even COBOL. Yep, the 1970s COBOL. Turns out legacy systems still keep the world running, and someone has to keep them alive.\n\nEventually, I caught the startup bug and launched my own company on 2018. Fast forward to 2023: I sold it, stayed on for two more years to see it through, and then decided it was time for a new adventure. That’s when PostHog came along.\n\nWhen I’m not writing code, you’ll usually find me with a guitar in hand. Otherwise, I might be on the PlayStation or watching soccer. \n\nI'm always happy to chat about code, music, or why your favorite team should have won last weekend.",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-08",
      "teams": [
        {
          "id": 115,
          "name": "Feature Flags",
          "slug": "feature-flags"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35321,
      "name": "Natalia Amorim",
      "firstName": "Natalia",
      "lastName": "Amorim",
      "role": "Content Marketing Manager",
      "location": "QC",
      "country": "CA",
      "latitude": 52.4760892,
      "longitude": -71.8258668,
      "formattedAddress": "Québec, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1761924662/Natalia_s_Portrait_1_fd2c5fe102.png",
      "biography": "Hi, I’m Natalia, but everyone calls me Nat.\n\nWork-wise, I started out crunching numbers as a marketing analyst at AB InBev, survived the rollercoaster that is agency life leading content & SEO for a large portfolio of global brands, then joined Turo to lead content and integrated marketing in Canada. Now I’m here to help tell PostHog's story as part of the Content team!\n\nI grew up in sunny Brazil and have spent the last seven years surviving Montreal winters (a heroic feat if you ask me). I speak English, French, Portuguese, and I like to think I speak Spanish too (haters will say I'm still just speaking Portuguese but with an accent, don't listen to them).\n\nI’m a proud Jill of all trades, master of none. My trophy shelf may not be overflowing, but my participation ribbons are enough to cover a gallery wall.\n\nThese days, my hyper-fixation is board sports – surfing being the main one, which is why I’m often spotted in Mexico, Brazil, or Costa Rica chasing warm waves (and avoiding wetsuits at all costs). When I’m not in the water, I skateboard, snowboard, box, do pilates, pole dance, and play volleyball. I’ve also rock climbed for many years, but a gnarly bouldering fall sent me into early retirement. Tried my hand at pottery too, but after making a lineup of ugly, lopsided mugs, I bowed out of that.\n\nMusic-wise, I’m a die-hard Arctic Monkeys fan and a folk/indie enthusiast. I’m also an avid house swapper (my favourite way to travel), splitting my time between Montreal and London. At home, I’m a cat mom to Maisie, a rescue Siberian who runs the household.",
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-08",
      "teams": [
        {
          "id": 123,
          "name": "Content",
          "slug": "content"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35339,
      "name": "Justin Nguyen",
      "firstName": "Justin",
      "lastName": "Nguyen",
      "role": "Technical Account Executive",
      "location": "Brooklyn",
      "country": "US",
      "latitude": 40.6526006,
      "longitude": -73.9497211,
      "formattedAddress": "Brooklyn, Kings County, City of New York, New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757950353/andy_5f8dbd96a6.png",
      "biography": "Dallasite who have given up on all Dallas-related sports activity and has found refuge in a quiet corner of Brooklyn. \n\nI have been involved in tech sales all of my post-grad phase. I immediately found that while connecting with people is where I excel, technology was something I genuinely enjoyed learning and working with. Talking is one thing but understanding what conversations I’m having is more gratifying than anything else. \n\nBesides conversing with tech people on what’s trending and how I can hep them, I’m learning to enhance my caffeine addiction with a bit of latte art and aeropress magic. I like to read, game, and run during my free time as well as other necessary tasks a human being may have. My global checklist is small but I hope to visit the Portuguese canned sardine factories sooner than later.\n",
      "color": "blue",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-09-08",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35378,
      "name": "Marce Coll",
      "firstName": "Marce",
      "lastName": "Coll",
      "role": "Back-end Engineer",
      "location": "Canet de Mar, ES",
      "country": "ES",
      "latitude": 41.5900933,
      "longitude": 2.5777998,
      "formattedAddress": "Canet de Mar, Maresme, Barcelona, Catalunya, 08360, España",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1757951447/image_removebg_preview_42_cbf5b23176.png",
      "biography": "When I was a kid I saw my father do some basic programming in Flash and I was hooked. I begged my parents for a programming book and they said it was too advanced, after some more begging and some promises I didn't intent to keep they finally bought me \"Flash MX 2004: Animaciones y Juegos\". I had limited access to a computer but I studied every code listing and section at night. I haven't stopped since.\n\nOn an average day you'll find me coding, eating, coding, playing with my daughter, coding, playing the Shakuhachi or even coding.",
      "color": "yellow",
      "pronouns": "He/Him",
      "pineappleOnPizza": false,
      "startDate": "2025-09-15",
      "teams": [
        {
          "id": 141,
          "name": "Billing",
          "slug": "billing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35811,
      "name": "Zbynek Novotny",
      "firstName": "Zbynek",
      "lastName": "Novotny",
      "role": "Talent Partner",
      "location": "Prague",
      "country": "CZ",
      "latitude": 50.0596288,
      "longitude": 14.4464593,
      "formattedAddress": "Praha, obvod Praha 4, Hlavní město Praha, Praha, Česko",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760463715/zbynek_87c6a55078.png",
      "biography": "I grew up in [Decin](https://en.wikipedia.org/wiki/D%C4%9B%C4%8D%C3%ADn), a small town in the north of Czechia, surrounded by the Czech Switzerland National Park with its [sandstone cliffs and canyons](https://blog.northernhikes.com/1502/how-to-visit-as-many-places-as-possible-in-czech-switzerland/). I still go back often to see my family and enjoy the nature.\n\nBasketball was my first big love and still is. I started again in 2024 and now play at least twice a week. Golf followed, introduced by my dad, although looking back I always preferred team sports to solo competition as the shared joy is the best!\n\nAt university in Prague I spent honestly more time on projects outside of uni than lectures. [The Prague Student Summit](https://www.studentsummit.cz/en/homepage/), a year-long program for high schoolers that I eventually led, taught me how fulfilling it is to build something meaningful with a team.\n\nMy career began in People and Talent at Impact Hub. I later joined Productboard just after their Series A, stayed through hypergrowth, and then worked with early-stage startups. Most recently I spent three years at Better Stack, helping scale their team. Across these roles I have come to believe that building healthier organizations is one of the efficient, yet non-obvious, ways to positively impact society.\n\nToday I live in Prague with my wife Sarka, a brand designer, and our dog Yvon, who sometimes makes guest appearances on calls as he's an avid attention seeker. Watch out!\n\nOutside work I recharge by hiking, playing basketball, journaling, and reading. I care deeply about Czech history and democracy. I have also been in psychotherapy for over three years, which has been transformative and helps me understand myself and others better.\n\nSome quirks: I enjoy public speaking but always get nervous, I am an ambivert who recharges the most while being alone or in small groups of people I know well, and Yvon has his own [Instagram](https://www.instagram.com/yvon_welsh/).",
      "color": "lime-green",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2025-09-15",
      "teams": [
        {
          "id": 156,
          "name": "Talent",
          "slug": "talent"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 36433,
      "name": "Judy Opperwall",
      "firstName": "Judy",
      "lastName": "Opperwall",
      "role": "Office Manager",
      "location": "San Francisco, CA",
      "country": "US",
      "latitude": 37.7792588,
      "longitude": -122.4193286,
      "formattedAddress": "San Francisco, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1762280123/Judy_s_Portrait_1_4819b169a3.png",
      "biography": "Hello! 👀\n\nI was born and raised in the SF Bay Area 🌉 and have lived here for most of my life. I currently reside in San Francisco proper and live with my husband (Hi Chris!!) in the Sunset district. When I'm not working, I like to go on runs in Golden Gate park, bake cookies, check out restaurants around the city and play lots of video games (Clair Obscur anyone...?). \n\nFor some brief history about me...I went to school at [Cal Poly San Luis Obispo](https://www.calpoly.edu/) to study Business Information Systems. Once I graduated, I mainly worked in consulting and project management, with my latest role being a Customer Success Manager at Surefyre, a company that has since merged with Vertafore this past year. After a few years at my last company, I decided that it was time for me to try something new (and different!), so here I am now working at PostHog as an Office Manager! If you see someone running around looking like a chicken with its head chopped off, it's probably me and just know that I'm trying my best 😅\n\nHere are some goals (personal and work-related) that I have set for myself this year (I promise I'll update this in 365 days)...\n\n1) Plan to bring in baked goods at least once a month to the office for the YC founders/PostHog employees to try and critique 🍪😭\n2) Make Hogpatch a fun, warm, and inviting space for people to do great things 💡🤔\n3) Try not to burn the place down 🙅🏻‍♀️🔥\n\nIf you're ever in San Francisco, come visit and say hello! I promise I don't bite 🐔",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-09-24",
      "teams": [
        {
          "id": 117,
          "name": "People & Ops",
          "slug": "people"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35250,
      "name": "Sven Lange",
      "firstName": "Sven",
      "lastName": "Lange",
      "role": "Platform Engineer",
      "location": "Budapest",
      "country": "HU",
      "latitude": 47.4813896,
      "longitude": 19.1460941,
      "formattedAddress": "Budapest, Közép-Magyarország, Magyarország",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1756400406/Sven_022812139d.png",
      "biography": "Hey, I'm Sven.\n\nI grew up in Germany and lived there most of my life. My last station in Germany was Munich but I moved to lovely Budapest in 2021 and have been here ever since.\n\nI've worked in a couple differently sized tech companies over the years with more or less similar stacks/technologies. I always had a focus on the more opsy side of \"DevOps\" and thoroughly enjoy digging deep into problems and fixing them.\n\nWhen I'm not working I like going to the gym or playing online games with friends. I enjoy a nice dinner at a restaurant with my wife and have somehow amassed about 50 different gins over the last couple of years.",
      "color": "blue",
      "pronouns": "he/him",
      "pineappleOnPizza": true,
      "startDate": "2025-10-01",
      "teams": [
        {
          "id": 114,
          "name": "Infrastructure",
          "slug": "infrastructure"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35355,
      "name": "Tomas Vnuk",
      "firstName": "Tomas",
      "lastName": "Vnuk",
      "role": "Technical Account Executive",
      "location": "Prague",
      "country": "CZ",
      "latitude": 50.0596288,
      "longitude": 14.4464593,
      "formattedAddress": "Praha, obvod Praha 4, Hlavní město Praha, Praha, Česko",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760644761/Tomas_V_s_Portrait_1_a617dfd9a3.png",
      "biography": null,
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-10-01",
      "teams": [
        {
          "id": 113,
          "name": "New Business Sales",
          "slug": "sales-cs"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 36864,
      "name": "Cleo Lant",
      "firstName": "Cleo",
      "lastName": "Lant",
      "role": "Product Marketing Manager",
      "location": "Toronto, Canada",
      "country": "CA",
      "latitude": 43.6534817,
      "longitude": -79.3839347,
      "formattedAddress": "Toronto, Golden Horseshoe, Ontario, Canada",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1761768467/Cleo_s_Portrait_1_e0d9ac23b6.png",
      "biography": "I started my career in the arts, detoured through a design agency, and quickly realized I wasn’t built for a single lane. I tried learning to code (retained nothing but respect for programmers), dabbled in UX/UI, and landed in marketing and content — picking up lessons in business, psychology, and creative problem-solving along the way.\n\nFor a while it felt like wandering, until I saw the pattern. I’m not a specialist. I’m a generalist with a knack for connecting dots. The in-between spaces are where I do my best work.\n\nJoining a startup early in my career was the best move I could’ve made. At Joyride, a B2B SaaS company, I learned how to be a Swiss army knife in a niche industry: launching a customer education platform, shaping brand identity, spinning up new products, crafting launch campaigns, and eventually writing my own job description as Director of Creative Solutions. \n\nOnly later did I realize I’d been doing product marketing all along.\n\nAs a PMM, I think of myself a bit like a bard in a fantasy party. My job isn’t to wield the biggest sword or cast the most powerful spell — it’s to help the whole team succeed by documenting the lore, amplifying strengths, and showing up for side quests with humor and enthusiasm. \n\nPostHog won me twice: first as a user of a platform that surfaced (what I previously thought were) invisible customer insights, then as a handbook that spoke to how I want to work (with high-agency people building killer products). Now I get to play my part here and see where the story goes.\n\nWhen I’m not online, you’ll find me outdoors, wandering Toronto’s tree- and flower-filled corners, or on a sunny patio with a book and a drink in hand.",
      "color": "seagreen",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-10-01",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 35224,
      "name": "Sara Miteva",
      "firstName": "Sara",
      "lastName": "Miteva",
      "role": "Product Marketer",
      "location": "Belgrade, Serbia",
      "country": "RS",
      "latitude": 44.8178131,
      "longitude": 20.4568974,
      "formattedAddress": "Београд, Град Београд, Централна Србија, Србија",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1762474012/sara_c5bd7a2c74.png",
      "biography": "I moved to Belgrade from Macedonia back in 2021. Ever since then, I can't imagine myself living anywhere else. If I ever move again, it won't be out of the Balkan Peninsula. I love the sun, the music, and most importantly - the red tomatoes out of my parents' garden. \n\nI read a ridiculous amount of books every year. I'm very sensitive to bad coffee. Very original. \n\nRunning is something I've been trying to do for years and I don't know how it's been going. I will try to run a half-marathon in December 2025, come back here after that to see if I made it. \n\nI've worked in startups almost all of my career. ",
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-10-01",
      "teams": [
        {
          "id": 154,
          "name": "Marketing",
          "slug": "marketing"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 36723,
      "name": "Andrew McGehee",
      "firstName": "Andrew",
      "lastName": "McGehee",
      "role": "Product Engineer",
      "location": "Austin, TX",
      "country": "US",
      "latitude": 30.2711286,
      "longitude": -97.7436995,
      "formattedAddress": "Austin, Travis County, Texas, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759713805/color_profile_c911d622a7.png",
      "biography": "hi! i'm Andrew. i don't really like the nickname Andy, but i don't mind Drew if you feel the intense urge. when i was younger i wanted to be a professional guitar player for a living. after trying it on for a few years at a music college and in the industry in Nashville, TN, i discovered it was a lot more monotonous than i realized. \n\ni dropped out of college ~~for the first time out of three~~. i met a software engineer that wrote recommender systems for Books-A-Million (he also had exquisite taste in coffee). the idea of software doing something so human as recommending books blew my mind. i was immediately hooked.\n\ni finished my bachelor's degree (mom was proud) and worked on a super cool, research-y AI team at Google for three years. afterward, i joined a startup working on agentic AI and knowledge graphs. despite some scar tissue from the experience, i really fell in love with startups. some of the coolest people you will ever meet!\n\n## random things i love\n\n* alphabetized lists (apparently)\n* chess – my highest rating was ~1200\n* chicago-style deep dish pizza – i bake one every year for Christmas for my family\n* go – the language not the game\n* going to hockey games – especially the tampa bay lightning, go bolts ⚡️\n* guitar – and possibly mandolin in the near future\n* jiu jitsu – i'm a purple belt\n* snowboarding – i try to go somewhere in the rockies once a year\n* zen – the browser and the eastern philosophy\n\n## random things i dislike\n\n* cucumbers\n* process for the sake of process\n* texts or DMs that just say \"hi\" or \"hey\"\n* what instagram has become",
      "color": "yellow",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-10-06",
      "teams": [
        {
          "id": 116,
          "name": "Data Stack",
          "slug": "data-stack"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 37401,
      "name": "Andy Maguire",
      "firstName": "Andy",
      "lastName": "Maguire",
      "role": "Product Engineer",
      "location": null,
      "country": "IE",
      "latitude": 52.9873334,
      "longitude": -6.4038632,
      "formattedAddress": "Glanmalure North Crag, Knockrath ED, The Municipal District of Arklow, County Wicklow, Leinster, Éire / Ireland",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1761349291/andy_m_592623227e.png",
      "biography": "nothing gets me going more than delivering stakeholder value through novel data insights!\n\nsome hot takes:\n- SQL is the new excel.\n- insurance is the OG of big data and ML/AI.\n- cli's are not the solution.\n- old school ML still is very important.\n- its not vibe coding, its \"Rick Rubining\" that matters.\n- Apple software is so bad i actually think there is something wrong with half the world.\n- The internet may very well destroy everything.\n- Don't ever hold any opinion too strongly.\n",
      "color": "salmon",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-10-13",
      "teams": [
        {
          "id": 139,
          "name": "LLM Analytics",
          "slug": "llm-analytics"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 37392,
      "name": "Kim Dugan",
      "firstName": "Kim",
      "lastName": "Dugan",
      "role": "Product Engineer",
      "location": "San Diego, California",
      "country": "US",
      "latitude": 32.7174202,
      "longitude": -117.162772,
      "formattedAddress": "San Diego, San Diego County, California, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760456950/Kim_D_56d40c8f88.png",
      "biography": "Looking back, I actually had a pretty early exposure to programming -- by trying to have the coolest pet pages on Neopets.com, obviously (I was amazed to learn their [HTML tutorial](https://www.neopets.com/help/html1.phtml) is still live, and pretty much completely unchanged in 20 years. Trying to style tables as a 9 year old made me SO frustrated!)\n\nGrowing up in San Diego, I went through the very typical career aspiration trajectory of local kids: SeaWorld dolphin trainer, pop-star, back to SeaWorld dolphin trainer, then aspirations to go to film/art school. Throughout all of this though, I always loved figuring out or learning things that previously seemed so opaque, it might as well be a foreign language -- including, way back as a child, learning how those simple HTML changes could change text color or insert images. \n\nA series of coincidences led to me eventually finding my way \"back\" to programming, declaring as a Computer Science major, and never looking back (aside from that one quarter where I debated once again transferring into the film school, but I digress). \n\nMy \"career\" so far has been: \n- iOS engineer -> \n- iOS engineer / full stack engineer -> \n- Dirtbag living in Yosemite in a tent for 6 months, climbing most days ->\n- full stack engineer With Opinions (TM) ->\n- Product Engineer at PostHog (opinions encouraged!)\n\nOutside of work, I still find myself gravitating towards things that originally seemed opaque and foreign -- eg rock climbing (I just completed my first Yosemite Big Wall!), which is essentially dozens of pounds of metal gear, physics, materials science and rope systems masquerading as a sport, except the consequence of getting it wrong is bodily injury instead of a runtime error. Fun! \n\nOther things: Reading (preferably at the beach), SD Mountain Search & Rescue Team, gardening and getting way too many veggies for me to ever eat, hyper-fixating on a video game for 2 months at a time, and hanging with my husband and two cats.\n",
      "color": "lilac",
      "pronouns": null,
      "pineappleOnPizza": false,
      "startDate": "2025-10-13",
      "teams": [
        {
          "id": 124,
          "name": "Replay",
          "slug": "replay"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 36036,
      "name": "Marko Locher",
      "firstName": "Marko",
      "lastName": "Locher",
      "role": "Technical Customer Success Manager",
      "location": "Austria",
      "country": "AT",
      "latitude": 47.59397,
      "longitude": 14.12456,
      "formattedAddress": "Österreich",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1758221640/FF_7_D5286_E639_407_D_893_B_E309_B5_E42_D99_1_105_c_10d592784f.png",
      "biography": "Growing up in Vienna, Austria makes sure of a couple of things: 1) I can be [quite grumpy](https://www.thelocal.at/20231117/vienna-ranked-least-friendly-city-in-the-world-for-foreigners), but try not to be, 2) I love skiing (it's basically a requirement for Austrians 🤷‍♂️) and 3) I expect public transport to be available and cheap. (That last one might be tricky when traveling 🙈)\n\nI started my tech career as a devops engineer (back when that wasn't really a thing yet) for a Vienna based startup working with satellite data and ESA. But I always enjoyed teaching more, so I switched into a support/customer success role when the chance came up and have been doing that ever since. So, if you have any questions regarding PostHog, just holler.\n\nIn my spare time I enjoy spending time in the mountains, hiking 🥾 in summer and skiing 🎿 in winter. And if there's still time I try to get some sailing ⛵ in as well.",
      "color": "blue",
      "pronouns": "he/him",
      "pineappleOnPizza": false,
      "startDate": "2025-10-20",
      "teams": [
        {
          "id": 146,
          "name": "Customer Success",
          "slug": "customer-success"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 36478,
      "name": "Matt Brooker",
      "firstName": "Matt",
      "lastName": "Brooker",
      "role": "Product Engineer",
      "location": "NY",
      "country": "US",
      "latitude": 43.1561681,
      "longitude": -75.8449946,
      "formattedAddress": "New York, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1759173178/Matt_e50c809358.png",
      "biography": "Hey! I go by Brooker, I live in upstate NY on a farm with my 2 kids, girlfriend, house dog, 2 house cats, 2 livestock guardian dogs, 2 barn cats, 2 geese, 2 pigs, 8 ducks, 5 guinea hens, and 31ish chickens. When I'm not cosplaying as a farmer, I like to hike/run up and down mountains, snowboard, do crossfit style workouts in my garage, and pwn my son at StarCraft II.\n\nI found out I could basically do realtime strategy games with words when I made a web scraper for a college internship and have been obsessively trying to figure out how to make software less painful for everyone ever since.\n\nI've been working on a [triathlon coach](https://www.guavatri.com/) with a buddy on the side, learning about incorporating generative AI into a product.",
      "color": "lime-green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-10-29",
      "teams": [
        {
          "id": 121,
          "name": "Growth",
          "slug": "growth"
        }
      ],
      "leadTeams": []
    },
    {
      "id": 37437,
      "name": "Catherine Ferland",
      "firstName": "Catherine",
      "lastName": "Ferland",
      "role": "Technical Account Manager",
      "location": "Providence, RI",
      "country": "US",
      "latitude": 41.8239891,
      "longitude": -71.4128343,
      "formattedAddress": "Providence, Providence County, Rhode Island, United States of America",
      "avatar": "https://res.cloudinary.com/dmukukwp6/image/upload/v1760464212/catherine_74636d4523.png",
      "biography": null,
      "color": "green",
      "pronouns": null,
      "pineappleOnPizza": true,
      "startDate": "2025-11-03",
      "teams": [
        {
          "id": 155,
          "name": "Product-Led Sales",
          "slug": "sales-product-led"
        }
      ],
      "leadTeams": []
    }
  ]
}
